[
  {
    "four-principles-of-shirk": {
      "category_id": 10,
      "title": "Four Principles Of Shirk",
      "slug": "four-principles-of-shirk",
      "content": [
        {
          "ar": "متن القواعد الأربعة للشيخ محمد بن عبد الوهاب رحمه الله\n",
          "en": "The text of The Four Principles, by Ash Shaykh Muhammad Ibn Abdul-Wahaab (Rahimahullah).  \nTranslated by Abu Maryam Isma&#8217;eel Alarcon (Al Ibaanah book publishing).\n"
        },
        {
          "ar": "أسأل الله الكريم رب العرش العظيم أن يتولاك في الدنيا والآخرة وأن يجعلك مباركاً أينما كنت وأن يجعلك ممن إذا أعطى شكر وإذا ابتلى صبر وإذا أذنب استغفر فإن هؤلاء الثلاث عنوان السعادة .\n",
          "en": " I ask Allaah, the Most Generous, Lord of the Great Throne to befriend you in this world and the Hereafter, and to make you blessed wherever you may be. And (I ask) that He make you from those who when they are given, are thankful; when they are tested, are patient; and when they sin, seek forgiveness (from Allaah). For indeed these three characteristics are the true signs of happiness.\n"
        },
        {
          "ar": "اعلم أرشدك الله لطاعته أن الحنيفية ملة إبراهيم أن تعبد الله وحده مخلصاً له الدين\n",
          "en": "Know, may Allaah grant you the ability to obey Him, that the Haneefiyyah, the religion of Ibraaheem is that you worship Allaah alone, making the Religion sincere for only Him.\n"
        },
        {
          "ar": "كما قال تعالى (وَمَا خَلَقْتُ الْجِنَّ وَالْأِنْسَ إِلَّا لِيَعْبُدُونِ)  (الذريات:56)\n",
          "en": "as Allaah says: “And I did not create the Jinn and mankind except to worship Me.”<br />\n[Surah Adh-Dhaariyaat: 56]\n"
        },
        {
          "ar": "فإذا عرفت أن الله خلقك لعبادته فاعلم أن العبادة لا تسمى عبادة إلا مع التوحيد كما أن الصلاة لا تسمى صلاة إلا مع الطهارة\n",
          "en": "So when you come to realize that Allaah created you in order to worship Him, then know that worship is not called worship unless it is accompanied by Tawheed, just as prayer is not called that unless it is accompanied by (ritual) purity.\n"
        },
        {
          "ar": "فإذا دخل الشرك في العبادة فسدت كالحدث إذا دخل في الطهارة\n",
          "en": "So if Shirk (mixing partners) enters into one’s worship, it ruins it, just like impurity when it enters into the (ritual) purity.\n"
        },
        {
          "ar": "فإذا عرفت أن الشرك إذا خالط العبادة أفسدها وأحبط العمل وصار صاحبه من الخالدين في النار عرفت أن أهم ما عليك معرفة ذلك لعل الله أن يخلصك من هذه الشبكة وهي الشرك بالله الذي قال الله تعالى فيه…\n",
          "en": "So when you come to realize that Shirk – when mixed into one’s worship – spoils it, invalidates one’s actions, and makes the person who possesses it into one who will reside eternally in the Hellfire, you will know that the most important thing that is binding upon you is to gain knowledge of that, so that perhaps Allaah may absolve you from this trap, which is ascribing partners to Allaah (i.e. Shirk) about which Allaah said:&#8230;\n"
        },
        {
          "ar": "فإذا عرفت أن الشرك إذا خالط العبادة أفسدها وأحبط العمل وصار صاحبه من الخالدين في النار عرفت أن أهم ما عليك معرفة ذلك لعل الله أن يخلصك من هذه الشبكة وهي الشرك بالله الذي قال الله تعالى فيه…\n",
          "en": "So when you come to realize that Shirk – when mixed into one’s worship – spoils it, invalidates one’s actions, and makes the person who possesses it into one who will reside eternally in the Hellfire, you will know that the most important thing that is binding upon you is to gain knowledge of that, so that perhaps Allaah may absolve you from this trap, which is ascribing partners to Allaah (i.e. Shirk) about which Allaah said:&#8230;\n"
        },
        {
          "ar": "الأولى : أن تعلم أن الكفار الذين قاتلهم رسول الله صلى الله عليه وسلم مقرون بأن الله تعالى هو الخالق المدبر وأن ذلك لم يدخلهم في الإسلام\n",
          "en": "The First Rule: You must know that the disbelievers whom the Messenger of Allaah fought against agreed that Allaah was the Creator and the Administrator. But this (belief) did not cause them to enter into the fold of Islaam.\n"
        },
        {
          "ar": "والدليل قوله تعالى<br />\n(قُلْ مَنْ يَرْزُقُكُمْ مِنَ السَّمَاءِ وَالْأَرْضِ أَمَّنْ يَمْلِكُ السَّمْعَ وَالْأَبْصَارَ وَمَنْ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَمَنْ يُدَبِّرُ الْأَمْرَ فَسَيَقُولُونَ اللَّهُ فَقُلْ أَفَلا تَتَّقُونَ)<br />\n(يونس:31) .\n",
          "en": "The proof for this is Allaah’s saying:<br />\n“Say: ‘Who provides for you from the sky and the earth, or who owns the hearing and the sight? And who brings out the living from the dead and brings out the dead from the living? And who administers the affairs?’ They will surely say: ‘Allaah.’ Say: ‘Will you then not be dutiful to Him?’”<br />\n[Surah Yoonus: 31]\n"
        },
        {
          "ar": "الثانية : أنهم يقولون ما دعوناهم وتوجهنا إليهم إلا لطلب القربة والشفاعة\n",
          "en": "The Second Rule: They (i.e. the disbelievers) said: “We did not invoke them nor turn towards them except to seek nearness (to Allah) and (their) intercession.\n"
        },
        {
          "ar": "فدليل القربة قوله تعالى<br />\n( وَالَّذِينَ اتَّخَذُوا مِنْ دُونِهِ أَوْلِيَاءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى إِنَّ اللَّهَ يَحْكُمُ بَيْنَهُمْ فِي مَا هُمْ فِيهِ يَخْتَلِفُونَ إِنَّ اللَّهَ لا يَهْدِي مَنْ هُوَ كَاذِبٌ كَفَّارٌ )<br />\n(الزمر: من الآية 3)\n",
          "en": "The proof for their seeking nearness (to Allaah) is His saying:<br />\n“And those who take protectors besides Him (say): ‘We don’t worship them except to bring us closer to Allaah.’ Verily Allaah will judge between them concerning that which they differ in.  Verily, Allaah does not guide he who is a liar, a disbeliever.”<br />\n[Surah Az-Zumar: 3]\n"
        },
        {
          "ar": "ودليل الشفاعة قوله تعالى<br />\n(وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لا يَضُرُّهُمْ وَلا يَنْفَعُهُمْ وَيَقُولُونَ هَؤُلاءِ شُفَعَاؤُنَا عِنْدَ اللَّه)<br />\n(يونس: من الآية 18)\n",
          "en": "The proof for their seeking intercession is Allaah’s saying:<br />\n“And they worship besides Allaah things that harm them not nor benefit them. And they say: ‘These are our intercessors besides Allaah.’”<br />\n[Surah Yoonus: 18]\n"
        },
        {
          "ar": "الشفاعة شفاعتان : شفاعة منفية وشفاعة مثبتة\n",
          "en": "Intercession is of two types: Intercession that is negated and Intercession that is affirmed.\n"
        },
        {
          "ar": "فالشفاعة المنفية ما كانت تطلب من غير الله فيما لا يقدر عليه إلا الله\n",
          "en": "The Negated Intercession is that which is sought from someone other than Allaah in matters that no one has the ability to carry out except Allaah.\n"
        },
        {
          "ar": "والدليل قوله تعالى<br />\n(يَا أَيُّهَا الَّذِينَ آمَنُوا أَنْفِقُوا مِمَّا رَزَقْنَاكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَ يَوْمٌ لا بَيْعٌ فِيهِ وَلا خُلَّةٌ وَلا شَفَاعَةٌ وَالْكَافِرُونَ هُمُ الظَّالِمُونَ)<br />\n(البقرة: 254)\n",
          "en": "The proof for this is Allaah’s saying:<br />\n“O you who believe! Spend of that which We have provided for you, before a Day comes when there will be no bargaining nor friendship nor intercession. And it is the disbelievers who are the wrong-doers.”<br />\n[Surah Al- Baqarah: 254]\n"
        },
        {
          "ar": "والشفاعة المثبتة هي التي تطلب من الله والشافع مكرم بالشفاعة والمشفوع له من رضي الله قوله وعمله بعد الإذن\n",
          "en": "The Affirmed Intercession is that which is sought from Allaah. The intercessor is one who is granted the honor of being able to intercede (by Allaah), while the one who is interceded for is the one whom Allaah is pleased with his statements and actions. (All of these occur) after Allaah’s permission is granted,\n"
        },
        {
          "ar": "كما قال تعالى<br />\n(ِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ) (البقرة: من الآية 255)\n",
          "en": "as Allaah says:<br />\n“Who is it that will intercede in His presence except with His permission.”<br />\n[Surah Al-Baqarah: 255]\n"
        },
        {
          "ar": "الثالثة : أن النبي صلى الله عليه وسلم ظهر على أناس متفرقين في عبادتهم منهم من يعبد الملائكة ومنهم من يعبد الأنبياء والصالحين ومنهم من يعبد الأشجار والأحجار ومنهم من يعبد الشمس والقمر وقاتلهم رسول الله صلى الله عليه وسلم ولم يفرق بينهم\n",
          "en": "The Third Rule:<br />\nThe Prophet was sent to people that differed from one another in their worship. Among them were those who worshipped the angels. And among them were those who worshipped the prophets and righteous people. And among them were those who worshipped trees and stones. And among them were those who worshipped the sun and the moon. However, the Messenger of Allaah fought against (all of) them and did not differentiate between any of them.\n"
        },
        {
          "ar": "والدليل قوله تعالى<br />\n(وَقَاتِلُوهُمْ حَتَّى لا تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ كُلُّهُ لِلَّهِ )<br />\n(لأنفال: من الآية 39)\n",
          "en": "The proof for this is Allaah’s statement:<br />\n“And fight against them until there is no more fitnah (trial, i.e. Shirk) and the Religion is all purely for Allaah alone.”<br />\n[Surah Al-Anfaal: 39]\n"
        },
        {
          "ar": "ودليل الشمس والقمر قوله تعالى<br />\n( وَمِنْ آيَاتِهِ اللَّيْلُ وَالنَّهَارُ وَالشَّمْسُ وَالْقَمَرُ لا تَسْجُدُوا لِلشَّمْسِ وَلا لِلْقَمَرِ وَاسْجُدُوا لِلَّهِ الَّذِي خَلَقَهُنَّ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ)<br />\n(فصلت:37)\n",
          "en": "The proof of them worshipping the sun and the moon is Allaah’s saying:<br />\n“And among His signs are the night and the day and the sun and the moon. Do not prostrate to the sun or the moon, but rather prostrate to Allaah who created them, if it is truly He whom you worship.”<br />\n[Surah Fussilat: 37]\n"
        },
        {
          "ar": "ودليل الملائكة قوله تعالى<br />\n(وَلا يَأْمُرَكُمْ أَنْ تَتَّخِذُوا الْمَلائِكَةَ وَالنَّبِيِّينَ أَرْبَاباً)<br />\n(آل عمران: من الآية 80)\n",
          "en": "The proof that they worshipped the angels is Allaah’s saying:<br />\n“And nor did he order you to take the angels and prophets as lords (besides Allaah).”<br />\n[Surah Aali ‘Imraan: 80]\n"
        },
        {
          "ar": "ودليل الأنبياء قوله تعالى<br />\n( وَإِذْ قَالَ اللَّهُ يَا عِيسَى ابْنَ مَرْيَمَ أَأَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وَأُمِّيَ إِلَهَيْنِ مِنْ دُونِ اللَّهِ قَالَ سُبْحَانَكَ مَا يَكُونُ لِي أَنْ أَقُولَ مَا لَيْسَ لِي بِحَقٍّ إِنْ كُنْتُ قُلْتُهُ فَقَدْ عَلِمْتَهُ تَعْلَمُ مَا فِي نَفْسِي وَلا أَعْلَمُ مَا فِي نَفْسِكَ إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ ) (المائدة:116)\n",
          "en": "The proof that they worshipped the prophets is Allaah’s saying:<br />\n“And when Allaah will say: ‘O ‘Eesaa, son of Maryam! Did you tell the people: Take me and my mother as gods besides Allaah?’ He will say: ‘Glory be to You, it is not for me to say what I have no right to say. Had I said such a thing, You would have surely known it. You know what is in my inner self yet I do not know what is in Your self. Verily, You re the All-Knower of the Unseen.’”<br />\n[Surah Al-Maa’idah: 116]\n"
        },
        {
          "ar": "دليل الصالحين قوله تعالى<br />\n(أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمُ الْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ وَيَرْجُونَ رَحْمَتَهُ وَيَخَافُونَ عَذَابَه)<br />\n(الاسراء:  من الآية 57)\n",
          "en": "The proof that they worshipped the righteous people is Allaah’s saying:<br />\n“Those whom they call unto (besides Allaah), they themselves seek the means of access to their Lord as to which of them will be the nearest (to Him). And they hope for His Mercy and fear His Torment.”<br />\n[Surah Al-Israa: 57]\n"
        },
        {
          "ar": "ودليل الأشجار والأحجار قوله تعالى (أَفَرَأَيْتُمُ اللَّاتَ وَالْعُزَّى)<br />\n(لنجم:19)<br />\n(وَمَنَاةَ الثَّالِثَةَ الْأُخْرَى)<br />\n(لنجم:20)\n",
          "en": "The proof that they worshipped trees and stones is Allaah’s saying:<br />\n“Have you then considered Al-Laat and Al-‘Uzzaa, and Manaat, the third other?”<br />\n[Surah An-Najm: 19-20]\n"
        },
        {
          "ar": "وحديث أبي واقد الليثي رضي الله عنه قال<br />\n&#8221; خرجنا مع النبي صلى الله عليه وسلم إلي حنين ونحن حدثاء عهد بكفر وللمشركين سدرة يعكفون عندها وينوطون بها أسلحتهم يقال لها ذات أنواط فمررنا بسدرة فقلنا يا رسول الله اجعل لنا ذات أنواط كما لهم ذات أنواط الحديث &#8220;\n",
          "en": "And also the hadeeth of Abu Waaqid Al-Laythee (radyAllaahu ‘anhu) who said:<br />\n“We went out with Allaah’s Messenger to (the Battle of) Hunayn, and we had just recently come out of Kufr (Disbelief). The polytheists used to have a lote-tree, which they would organize by and hang their swords on (seeking blessings from it); it was called Dhaat Anwaat. So we passed by a lote-tree and said: ‘O Messenger of Allaah! Make for us a Dhaat Anwaat, just as they have a Dhaat Anwaat?’”\n"
        },
        {
          "ar": "الرابعة : أن مشركي زماننا أغلظ شركاً من الأولين لأن الأولين يشركون في الرخاء ويخلصون في الشدة ومشركو زماننا شركهم دائماً في الرخاء والشدة\n",
          "en": "The Fourth Rule:<br />\nThe polytheists in our era are more severe in their (committing of) Shirk than the first polytheists (during the Prophet’s time). This was since the first polytheists used to ascribe partners to Allaah at times of ease and worship Him sincerely during times of hardship. However, the polytheists in our era constantly commit Shirk in times of ease as well as in times of hardship.\n"
        },
        {
          "ar": "والدليل قوله تعالى<br />\n(فَإِذَا رَكِبُوا فِي الْفُلْكِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذَا هُمْ يُشْرِكُونَ)<br />\n(العنكبوت:65)\n",
          "en": "The proof for this is Allaah’s statement:<br />\n“And when they embark on a ship, they invoke Allaah making their Faith purely for Him alone. But when He brings them safely to land, behold they give a share of their worship to others.”<br />\n[Surah Al-‘Ankaboot: 65]\n"
        },
        {
          "ar": "تمت وصلى الله على محمد وآله وصحبه وسلم\n",
          "en": "This completes the treatise. May the peace and blessings of Allaah be on Muhammad, his family and Companions.\n"
        }
      ]
    }
  },
  {
    "al-ajaroomiyyah": {
      "category_id": 12,
      "title": "Al-Ajaroomiyyah",
      "slug": "al-ajaroomiyyah",
      "content": [
        {
          "ar": "<strong>تيسيرالآجرومية</strong>\n",
          "en": "Simplifying Al-Ajaroomiyyah<br />\nCOMPILED BY: ABUL-LAYTH QASIM IBN AGGREY MUTIVA\n"
        },
        {
          "ar": "﷽<br />\nأنواع الكلام<br />\nاَلْكَلَامُ : هو اَلَّلفْظُ اَلُمرَكَّبُ، اَلُمفِيدُ بِالْوَضْعِ . وََأقْسَاُمهُ ثَلَاَثةٌ : اسم ، وَفْعلٌ ، وَحَرْفٌ جاءَ لعنى.\n",
          "en": "<strong>Types of Speech</strong><br />\nSpeech: Is the composed saying or utterance which is beneficial in its placement or composition.  And it is divided into three groups: Ism (noun), and F&#8217;il (verb), and Harf (a preposition which conveys meaning).\n"
        },
        {
          "ar": "فَاِلاسْمُ يُعرفُ بالخفْضِ وَالتنَّوِْينِ، وَدُخُولِ الأَلفِ وَاللَّامِ\n",
          "en": "So the Ism (Noun) is known by Al-Khafdh (the acceptance of Jarr), and At-Tanween (a mark which indicates indefiniteness), and the acceptance of Alif Laam (the definite article).\n"
        },
        {
          "ar": "وَحُرُوفِ اَلْخفَْضِ، وَهِيَ مِنْ، وَإِلَى، وَعَنْ، وَعَلَى، وَفِي، وَرُبَّ، وَالبَاءُ، وَالْكَافُ، وَاللَّامُ\n",
          "en": "And the letters of Khafdh are min and Eelaa and &#8216;An and &#8216;Ala and Fee and Rubba and Al-Baa and Al-Kaaf and Al-Laam.\n"
        },
        {
          "ar": "وَحُرُوفُ اَلْقَسَمِ، وَهِيَ اَلْوَاُو، وَالَْباءُ، وَالتاَّءُ\n",
          "en": "And the letters of Avowal (Pledge) are: Al-Waaw and Al-Baa and At-Taa.\n"
        },
        {
          "ar": "وَالْفِْعُل يُعَْرفُ بِقَدْ ، وَالسِّينِ ، وََسْوفَ ، وَتَاءِ اَلتَّأِْنيثِ اَلَّساكِنةَِ.\n",
          "en": "And The F&#8217;il (Verb) is known by Qad and As-Seen and Sawfa and At-Taa At-Ta&#8217;neeth As-Saakinah.\n"
        },
        {
          "ar": "وَالحَرْفُ مَا لَا يَصْلُُح مََعهُ دَليِلُ اَلِاسْمِ وَلَاَ دليِلُ اَلْفِعْلِ.\n",
          "en": "And the Harf (Preposition) is that which does not accept any of the Ism (Noun) or F&#8217;il (Verb) indicators or signs.\n"
        },
        {
          "ar": "اَلْإِعْرَابُ هُوَ:<br />\nتغيير أَوَاخِرِ اَلْكَلِمِ لِاخْتِلَافِ اَلْعَوَامِلِ اَلدَّاخِلَةِ عَلَيْهَا لَفْظًا أَوْ تَقْدِيرًا\n",
          "en": "The Grammatical analysis is the changing of vowel markings at the end of words according to the addition of specific helping words or prepositions whether they are written or supposed.\n"
        },
        {
          "ar": "وَأَقْسَامُهُ أَرْبَعَةٌ: رَفْعٌ، وَنَصْبٌ، وَخَفْضٌ، وَجَزْمٌ،\n",
          "en": "The categories of grammatical analysis are four:<br />\nRaf&#8217; and Nasb and Khafdh and Jazm\n"
        },
        {
          "ar": "فَلِلْأَسْمَاءِ مِنْ ذَلِكَ: اَلرَّفْعُ، وَالنَّصْبُ، وَالْخَفْضُ، وَلَا جَزْمَ فِيهَا\n",
          "en": "So for the nouns is Raf&#8217;, Nasb and Khafdh with Jazm not included.\n"
        },
        {
          "ar": "وَلِلْأَفْعَالِ مِنْ ذَلِكَ: اَلرَّفْعُ، وَالنَّصْبُ، وَالْجَزْمُ، وَلَا خَفْضَ فيها.\n",
          "en": "And for the verbs is Raf&#8217;, Nasb and Jazm with Khafdh not included\n"
        },
        {
          "ar": "بَابُ مَعْرِفَةِ عَلَامَاتِ اَلْإِعْرَابِ<br />\nلِلرَّفْعِ أَرْبَعُ عَلَامَاتٍ: الضمة ، والواو، وَالْأَلِفُ، وَالنُّونُ \n",
          "en": "There are four signs which indicate the condition of Raf&#8217;:<br />\nThe Dhommah, the Waaw, the Alif and the Noon.\n"
        },
        {
          "ar": "فَأَمَّا اَلضَّمَّةُ: فَتَكُونُ عَلَامَةً لِلرَّفْعِ فِي أَرْبَعَةِ مَوَاضِعَ:<br />\nفِي اَلِاسْمِ اَلْمُفْرَدِ، وَجَمْعِ اَلتَّكْسِيرِ، وَجَمْعِ اَلْمُؤَنَّثِ اَلسَّالِمِ، وَالْفِعْلِ اَلْمُضَارِعِ اَلَّذِي لَمْ يَتَّصِلْ بِآخِرِهِ شَيْءٌ.\n",
          "en": "As for the Dhommah, Then it is an indicator of Raf&#8217; in four Instances:<br />\n1. The Singular Noun<br />\n2.The Broken Plural<br />\n3.The Sound Feminine plural<br />\n4.The present tense verb which has nothing attached to the end of it.\n"
        },
        {
          "ar": "وَأَمَّا اَلْوَاوُ:<br />\nفَتَكُونُ عَلَامَةً لِلرَّفْعِ فِي مَوْضِعَيْنِ فِي جَمْعِ اَلْمُذَكَّرِ اَلسَّالِمِ، وَفِي اَلْأَسْمَاءِ اَلْخَمْسَةِ، وَهِيَ أَبُوكَ، وَأَخُوكَ، وَحَمُوكَ، وَفُوكَ، وَذُو مَالٍ\n",
          "en": "As for the Waaw, Then it is an indicator of Raf&#8217; in two cases:<br />\n1.The Sound Masculine plural and<br />\n2.The Five Exceptional Nouns, which are: Abooka, Akhooka, Hamooka, Fooka, and Dhoo Maalin\n"
        },
        {
          "ar": "وَأَمَّا اَلْأَلِفُ:<br />\nفَتَكُونُ عَلَامَةً لِلرَّفْعِ فِي تَثْنِيَةِ اَلْأَسْمَاءِ خَاصَّةً.\n",
          "en": "As for the Alif, Then it is an indicator of Raf&#8217; specifically in the dual forms.\n"
        },
        {
          "ar": "وَأَمَّا اَلنُّونُ: فَتَكُونُ عَلَامَةً لِلرَّفْعِ فِي اَلْفِعْلِ اَلْمُضَارِعِ، إِذَا اِتَّصَلَ بِهِ ضَمِيرُ تَثْنِيَةٍ، أَوْ ضَمِيرُ جَمْعٍ، أَوْ ضَمِيرُ اَلْمُؤَنَّثَةِ اَلْمُخَاطَبَةِ. \n",
          "en": "As for the Noon, Then it is an indicator of Raf&#8217; in the present tense if it is connected to an attached pronoun of duality, an attached pronoun of plurality, or an attached pronoun used to address the female gender.\n"
        },
        {
          "ar": "وَلِلنَّصْبِ خَمْسُ عَلَامَاتٍ: الْفَتْحَةُ، وَالْأَلِفُ، وَالْكَسْرَةُ، وَاليَاءُ، وَحَذْفُ النُّونِ.\n",
          "en": "And for the condition of Nasb there are five signs: the Fathah, the Alif, the Kasrah, the Yaa, and the removal of the letter Noon.\n"
        },
        {
          "ar": "فَأَمَّا الْفَتْحَةُ: فَتَكُونُ عَلَامةً لِلنَّصْبِ فِي ثَلَاثَةِ مَوَاضِعَ: فِي الْاِسْمِ الْمُفْرَدِ، وَجَمْعِ التَّكْسِيرِ، وَالْفِعْلِ الْمُضَارِعِ إِذَا دَخَلَ عَلَيْهِ نَاصِبٌ وَلَمْ يَتَّصِلْ بِآَخِرِهِ شَيْءٌ. \n",
          "en": "As for the Fathah, then it is an indicator of the state of Nasb in three instances:<br />\n1. In the Singular Nouns.<br />\n2. In broken plural forms.<br />\n3. In the Present tense verbs if a Naasib (subjunctival) precedes it and there is nothing attached to the last letter in the verb.\n"
        },
        {
          "ar": "وَأَمَّا الْأَلِفُ: فَتَكُونُ عَلَامَةً لِلنَّصْبِ فِي الْأَسْمَاءِ الْخَمْسَةِ، نَحْوَ: &#8220;رَأَيْتُ أَبَاكَ وَأَخَاكَ&#8221; وَمَا أَشْبَهَ ذَلِكَ.\n",
          "en": "As for the Alif, then it is an indicator of the state of Nasb in<br />\nthe Five Nouns. Like the following example: &#8220;رَأَيْتُ أَبَاكَ وَأَخَاكَ&#8221; And whatever resembles this.\n"
        },
        {
          "ar": "وَأَمَّا الْكَسْرَةُ: فَتَكُونُ عَلَامَةً لِلنَّصْبِ فِي جَمْعِ الْمُؤَنَّثِ السَّالِمِ.\n",
          "en": "As for the Kasrah, then it is an indicator of the state of Nasb for the Sound Feminine Plurals.\n"
        },
        {
          "ar": "وَأَمَّا الْيَاءُ: فَتَكُونُ عَلَامَةً لِلنَّصبِ فِي التَّثْنِيَةِ وَالْجَمْعِ.\n",
          "en": "As for the the Yaa, then it is an indicator of the state of Nasb in both the Dual and Plural Noun forms.\n"
        },
        {
          "ar": "وَأَمَّا حَذْفُ النُّونِ: فَيَكُونُ عَلَامَةً لِلنَّصْبِ فِي الْأَفْعَالِ الْخَمْسَةِ الْتِي رَفْعُهَا بِثَبَاتِ النُّونِ.\n",
          "en": "As for the removal of the letter Noon, then it is an indicator of the state of Nasb in the Five Verbs when the indicator of the state of Raf&#8217; is the fixedness of the letter Noon.\n"
        },
        {
          "ar": "وَلِلْخَفْضِ ثَلَاثُ عَلَامَاتٍ: الْكَسْرَةُ، وَالْيَاءُ، وَالْفَتْحَةُ.\n",
          "en": "And for the condition of Khafdh, there are three signs, The Kasrah, the Yaa, and the Fathah.\n"
        },
        {
          "ar": "فَأَمَّا الْكَسْرَةُ: فَتَكُونُ عَلَامَةً لِلْخَفْضِ فِي ثَلَاثَةِ مَوَاضِعَ: فِي الْاِسْمِ الْمُفْرَدِ الْمُنْصَرِفِ، وَجَمْعِ التَّكْسِيرِ الْمُنْصَرِفِ، وَفِي جَمْعِ الْمُؤَنَّثِ السَّالِمِ.\n",
          "en": "As for the Kasrah, then it is an indicator of the state of Khafdh in three instances.<br />\n1. The Singular Noun which has vowel markings that can be changed. 2. In Broken Plural forms where the vowel markings can also be changed. 3. In the Sound Feminine Plurals.\n"
        },
        {
          "ar": "وَأَمَّا الْيَاءُ: فَتَكُونُ عَلَامَةً لِلْخَفْضِ فِي ثَلَاثَةِ مَوَاضِعَ: فِي الْأَسْمَاءِ الْخَمْسَةِ، وَفِي التَّثْنِيَةِ، وَالْجَمْعِ.\n",
          "en": "As for the Yaa, then it is an indicator of the state of Khafdh in three instances.<br />\n1.The Five Nouns.<br />\n2.The Dual Forms.<br />\n3.The Plural forms.\n"
        },
        {
          "ar": "وَأَمَّا الْفَتْحَةُ: فَتَكُونُ عَلَامَةً لِلْخَفْضِ فِي الْاِسْمِ الَّذِي لَا يَنْصَرِفُ.\n",
          "en": "As for the Fathah, then it is an indicator of the state of Khafdh for the Nouns which are fixed and do not change their vowel markings.\n"
        }
      ]
    }
  },
  {
    "laamiyah": {
      "category_id": 10,
      "title": "Laamiyah",
      "slug": "laamiyah",
      "content": [
        {
          "ar": "لامية لشيخ الإسلام ابن تيمية رحمه الله\n",
          "en": "The text of Laamiyyah \nAttributed to Shaykh al-Islaam Ibn Taymiyyah (rahimahullaah)\nTranslated by Abu ʿIyaad\n"
        },
        {
          "ar": "يا سائِلي عَنْ مَذْهَبي وعَقيدَتي ** رُزِقَ الهُدَى مَنْ لِلْهِدايَةِ يسألُ\n",
          "en": "O one who asks about my doctrine and creed &#8211; Certainly, bestowed with guidance is he who asks for guidance.\n"
        },
        {
          "ar": "اسمع كلامَ مُحَقِّقٍ في قوله ** لا ينْثنـي عنـهُ ولاَ يتبـدّلُ\n",
          "en": "Listen to the speech of one who has ascertained the truth of his statement &#8211; Without departing from it nor replacing it (with something else)\n"
        },
        {
          "ar": "حُبُّ الصحابةِ كُلِّهِم لي مذهبٌ ** ومودةُ القربى بِهـا أَتَوسّـلُ\n",
          "en": " Loving the Companions, all of them (without exception) is for me a (school of) doctrine &#8211; And love of the nearest ones (the Ahl al-Bayt) do I seek as a means of nearness (to Allaah)\n"
        },
        {
          "ar": "وَلِكُلّهم قـدرٌ عَـلا وَفَضائِـلٌ** لكِنَّما الصِّديقُ مِنْهـم أَفْضَـلُ\n",
          "en": " And every one of them has a station and a shining excellence &#8211; However, amongst them [Abu Bakr] al-Siddeeq is the most excellent.\n"
        },
        {
          "ar": "وأقول في القرآن ما جاءت بِهِ ** آياتُهُ فَهـو الكريم الُمنْـزَلُ\n",
          "en": " And I say regarding the Qur&#8217;an (only) that which has come &#8211; [In its] verses, for it is the Noble Revelation.\n"
        },
        {
          "ar": "وأقولُ قالَ اللهُ جـلَّ جلالُـهُ ** والمُصْطفى الهادي وَلا أَتأَوَّلُ\n",
          "en": " And I say, &#8220;Allaah, the Mighty and Majestic said&#8221; &#8211; [And likewise] &#8220;the Chosen One (the Prophet) [said],&#8221; and I do not explain away (their speech).\n"
        },
        {
          "ar": "وجميعُ آياتِ الصفاتِ أُمِرُّهَـا ** حَقَّاً كما نَقَـلَ الطِّـرازُ الأَوَّلُ\n",
          "en": " And all the verses of the attributes I pass them on &#8211; In truth, just as the first (and best of generations) have transmitted [without explaining them away].\n"
        },
        {
          "ar": "و أَردُّ عهدتَهـا إلـى نُقّالِهـا ** وأَصونها عَنْ كُلِ ما يُتَخيّـلُ\n",
          "en": " And I return the obligatory responsibility towards them to those who transmitted them (intact) &#8211; And I protect them from all that is imagined (with respect to their realities).\n"
        },
        {
          "ar": "قبْحَاً لِمَنْ نَبَذَ القـرآن وراءهُ ** وإذا أستدلَّ يقول قال الأخْطَلُ\n",
          "en": " Disgrace for the one who threw the Qur&#8217;aan behind his back &#8211; And when asked to provide evidence, says, &#8220;al-Akhtal [the Christian] said!&#8221;\n"
        },
        {
          "ar": "و المـؤمنون يَرَوْنَ حقَّـاً رَبَّهُـم ** وإلى السماءِ بِغيْرِ كيْفٍ يَنْزِلُ\n",
          "en": "  And the Believers will see their Lord in Truth (in the Hereafter) &#8211; And to the heaven does He descend without (designating) a how.\n"
        },
        {
          "ar": "وأُقِرُّ بالميزانِ و الحـوضِ الذي ** أَرْجُو بِأنِّي منه رِيَّـاً أنهـلُ\n",
          "en": " And I affirm the Scales and the Pool which &#8211; I hope to be (amongst those) whose thirst will be quenched (by it).\n"
        },
        {
          "ar": "وكذا الصراطُ يُمَدُّ فَوْقَ جَهَنِّمٍ ** فمُسلمٌ نَـاجٍ وآخـرُ مُهمـلُ\n",
          "en": " And likewise (I affirm) the Bridge extended over Hellfire (over which all will pass) &#8211; So (either) one made safe (and) delivered (or) another forsaken (who will fall).\n"
        },
        {
          "ar": "والنارُ يَصلاها الشقيُّ بحكمةٍ ** وكذا التقيُّ إلى الجِنانِ سيدخلُ\n",
          "en": " And the wretched one will be burned in the Fire by Divine wisdom &#8211; And likewise (by Divine wisdom) the pious one will enter Gardens.\n"
        },
        {
          "ar": "وَلِكُلِ حيِّ عاقـلٍ فـي قبـرِهِ ** عملٌ يُقارنُهُ هنـاك ويُسـألُ\n",
          "en": " And every mentally-sound living person will have in his grave &#8211; His deeds to accompany him and for which he will be questioned.\n"
        },
        {
          "ar": "هذا اعِتقَادُ الشَّافعـيِّ ومالِـكٍ ** وأبي حنيفةَ ثُـمَّ أحمـدَ يُنْقَـلُ\n",
          "en": " This is the creed of al-Shaafi&#8217;ee and Maalik &#8211; And Abu Haneefah and then Ahmad which has been transmitted.\n"
        },
        {
          "ar": "فإنْ اتَّبعْتَ سَبِيلَهُـم فَمُوَفَـقٌ ** وإن ابتدعت فما عليك مُعـوِّلُ\n",
          "en": " So if you follow their path, then success have you been granted &#8211; And if you innovate then no support (whatsoever) do you have.\n"
        }
      ]
    }
  },
  {
    "three-fundamental-principles": {
      "category_id": 10,
      "title": "Three Fundamental Principles",
      "slug": "three-fundamental-principles",
      "content": [
        {
          "ar": "متن الأصول الثلاثة للشيخ محمد بن عبد الوهاب رحمه الله\n",
          "en": "The Three Fundamental Principles of Al-Islaam and Their Proofs, by Ash Shaykh Muhammad Ibn Abdul-Wahaab (Rahimahullah).  \nTranslated by Abu Maryam Isma`eel Alarcon (Al Ibaanah book publishing)  Recited by Ash Shaykh Mohammed Sa`eed Raslan.\n"
        },
        {
          "ar": "بسم الله الرحمان الرحيم &#8211; اعْلمْ رَحِمَكَ اللهُ أَنَّهُ يَجِبُ عَلَيْنَا تَعَلُّمُ أَرْبَعِ مَسَائِلَ:\n",
          "en": "In the Name of Allaah, the Most Merciful, the Bestower of Mercy.  Know, may Allaah have mercy on you, that we are obligated to learn four matters:\n"
        },
        {
          "ar": "الأُولَى: الْعِلْمُ: وَهُوَ مَعْرِفَةُ اللهِ، وَمَعْرِفَةُ نَبِيِّهِ ـ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ـ، وَمَعْرِفَةُ دِينِ الإِسْلامِ بالأَدِلَّةِ.<br />\nالثَّانِيَةُ: الْعَمَلُ بِهِ<br />\nالثَّالِثَةُ: الدَّعْوَةُ إِلَيْهِ<br />\nالرَّابِعَةُ: الصَّبْرُ عَلَى الأَذَى فِيهِ.\n",
          "en": "First: Knowledge, which means: awareness of Allaah, awareness of His Prophet, and awareness of the Religion of Islaam, based on evidences.  \nSecond: Acting on this.  \nThird: Calling to it.  \nFourth: Patience with the harm that befalls due to it.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\nبسم الله الرحمن الرحيم<br />\n﴿وَالْعَصْرِ &#8211; إِنَّ الأِنْسَانَ لَفِي خُسْرٍ &#8211; إِلّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ﴾ &#8211; [ سورة العصر ] \n",
          "en": "The proof for this is (the meaning of) Allaah`s saying:\nIn the Name of Allaah, the Most Merciful, the Bestower of Mercy.\n“By the time! &#8211; Verily mankind is at loss – except for those who believe and perform righteous deeds, and advise one another towards the truth and advise one another towards patience”. &#8211; [Surah Al-`Asr]\n"
        },
        {
          "ar": "قَالَ الشَّافِعيُّ ـ رَحِمَهُ اللهُ تَعَالَى ـ: لَوْ مَا أَنْزَلَ اللهُ حُجَّةً عَلَى خَلْقِهِ إِلا هَذِهِ السُّورَةَ لَكَفَتْهُمْ.\n",
          "en": "Ash-Shaafi`ee, may Allaah have mercy on him, said: “Had Allaah not sent down a proof to His creation other than this surah (chapter), it would have been sufficient for them”.\n"
        },
        {
          "ar": "وَقَالَ البُخَارِيُّ ـ رَحِمَهُ اللهُ تَعَالَى ـ: بَابٌ: العِلْمُ قَبْلَ القَوْلِ وَالْعَمَلِ؛<br />\n وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\n ﴿فَاعْلَمْ أَنَّهُ لاَ إِلَٰه إِلاَّ اللَّهُ وَاسْتَغْفِرْ لِذَنبِكَ﴾ [محمد:19]<br />\n، فَبَدَأَ بِالْعِلْمِ (قَبْلَ القَوْلِ وَالعَمَلِ)\n",
          "en": "Al-Bukhaaree, may Allaah have mercy on him, said:<br />\nChapter: “Knowledge comes before speech and action”.\nThe proof for this is (the meaning of) Allaah`s saying:<br />\n“So know  that there is no deity worthy of worship except Allaah, and seek forgiveness for your sins”. &#8211; [Surah Muhammad: 19] \nSo He began by mentioning knowledge before speech and action.\n"
        },
        {
          "ar": "اعْلَمْ رَحِمَكَ اللهُ أَنَّه يَجِبُ عَلَى كُلِّ مُسْلِمٍ وَمُسْلِمَةٍ، تَعَلُّمُ ثَلاثِ هَذِهِ الْمَسَائِل، والْعَمَلُ بِهِنَّ:\n",
          "en": "Know, may Allaah have mercy on you, that it is obligatory upon every Muslim male and female to learn and act upon the following three things:\n"
        },
        {
          "ar": "الأُولَى: أَنَّ اللهَ خَلَقَنَا، وَرَزَقَنَا، وَلَمْ يَتْرُكْنَا هَمَلا، بَلْ أَرْسَلَ إِلَيْنَا رَسُولاً، فَمَنْ أَطَاعَهُ دَخَلَ الجَنَّةَ، وَمَنْ عَصَاهُ دَخَلَ النَّارَ،\n",
          "en": "First: That Allaah created us, provided sustenance for us, and did not leave us neglected. Rather, He sent a Messenger to us. So whoever obeys him will enter Paradise, whereas whoever disobeys him will enter the Hellfire.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى: ﴿إِنَّا أَرْسَلْنَا إِلَيْكُمْ رَسُولاً شَاهِداً عَلَيْكُمْ كَمَا أَرْسَلْنَا إِلَى فِرْعَوْنَ رَسُولاً * فَعَصَى فِرْعَوْنُ الرَّسُولَ فَأَخَذْنَاهُ أَخْذاً وبيلا﴾<br />\n[المزمل: 15، 16].\n",
          "en": "The proof for this is (the meaning of) Allaah`s statement:<br />\n“Verily, We sent to you a Messenger, to be a witness over you, just as we sent a Messenger to Pharaoh. But Pharaoh disobeyed the Messenger [i.e. Moosaa] so We seized him with a severe punishment” &#8211; [Surah Al-Muzzammil: 15-16]\n"
        },
        {
          "ar": "الثَّانِيَةُ: أَنَّ الله لا يَرْضَى أَنْ يُشْرَكَ مَعَهُ أَحَدُ فِي عِبَادَتِهِ، لا مَلَكٌ مُقَرَّبٌ، وَلا نَبِيٌّ مُرْسَلٌ؛\n",
          "en": "Second: Allaah is not pleased with anyone being mixed into worship with Him – neither an angel brought close nor a prophet that was sent.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى: ﴿وَأَنَّ الْمَسَاجِدَ لِلَّهِ فَلاَ تَدْعُوا مَعَ اللَّهِ أَحَداً ﴾<br />\n[الجن: 18].\n",
          "en": "The proof for this is (the meaning of Allaah`s statement):“And verily the masaajid belong to Allaah, so do not call unto anyone along with Allaah.” &#8211;<br />\n[Surah Al-Jinn: 18]\n"
        },
        {
          "ar": "الثَّالِثَةُ: أَنَّ مَنْ أَطَاعَ الرَّسُولَ، وَوَحَّدَ اللهَ لا يَجُوزُ لَهُ مُوَالاةُ مَنْ حَادَّ اللهَ وَرَسُولَهُ، وَلَوْ كَانَ أَقْرَبَ قَرِيبٍ؛\n",
          "en": "Third: Whoever obeys the Messenger [i.e. Muhammad] and singles Allaah out [in worship], it is not permissible for him to take as allies those who oppose Allaah and His Messenger, not even if they are close relatives.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى: ﴿ لاَ تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الآخِرِ يُوَادُّونَ مَنْ حَادَّ اللَّهَ وَرَسُولَهُ وَلَوْ كَانُوا آبَاءَهُمْ أَوْ أَبْنَاءهُمْ أَوْ إِخْوَانَهُمْ أَوْ عَشِيرَتَهُمْ أُوْلَئِكَ كَتَبَ فِي قُلُوبِهِمُ الإِيمَانَ وَأَيَّدَهُم بِرُوحٍ مِّنْهُ وَيُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا رَضِيَ  اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ أُوْلَئِكَ حِزْبُ اللَّهِ أَلاَ إِنَّ حِزْبَ اللَّهِ هُمُ الْمُفْلِحُونَ ﴾<br />\n[المجادلة: 22].\n",
          "en": "The proof for this is (the meaning of) Allaah`s saying:\n“You will not find any people who believe in Allaah and the Last Day making friendship with those who oppose Allaah and His Messenger, even if they are their fathers or their sons or their brothers or there kindred. For such He has written Faith in their hearts, and strengthened them with Rooh (light and guidance) from Himself. And He will admit them into Gardens under which rivers flow to dwell therein forever. Allah is pleased with them and they with Him. They are the party of Allaah. Verily it is the party of Allaah that will be the successful”.<br />\n&#8211; [Surah Al-Mujaadilah: 22]\n"
        },
        {
          "ar": "اعْلَمْ أَرْشَدَكَ اللهُ لِطَاعَتِهِ، أَنَّ الْحَنِيفِيَّةَ مِلَّةَ إِبْرَاهِيمَ: أَنْ تَعْبُدَ اللهَ وَحْدَهُ، مُخْلِصًا لَهُ الدِّينَ. وَبِذَلِكَ أَمَرَ اللهُ جَمِيعَ النَّاسِ، وَخَلَقَهُمْ لَهَا؛\n",
          "en": "Know, may Allaah grant you the ability to obey Him, that Al-Haneefiyyah, the Religion of Ibraaheem, is that you worship Allaah alone, making the religion sincerely [i.e. solely] for Him. This is what Allaah ordered all of mankind to do, and this is the purpose for which He created them\n"
        },
        {
          "ar": "كَمَا قَالَ تَعَالَى: ﴿ وَمَا خَلَقْتُ الْجِنَّ وَالإِنْسَ إِلاَّ لِيَعْبُدُونِ ﴾ [ الذاريات: 56].<br />\nوَمَعْنَى ﴿يَعْبُدُونِ﴾ : يُوَحِّدُونِ\n",
          "en": "As (in the meaning of what) He says:\n“And I did not create the Jinn and mankind except to worship Me.”<br />\n&#8211; [Surah Adh-Dhaariyaat: 56] \nThe meaning of “to worship Me” is “to single Allaah out [in worship].”\n"
        },
        {
          "ar": "وَأَعْظَمُ مَا أَمَرَ اللهُ بِهِ التَّوْحيِدُ، وَهُوَ: إِفْرَادُ اللهِ بِالْعِبَادَةِ. وَأَعْظَمُ مَا نَهَى عَنْه الشِّركُ، وَهُوَ: دَعْوَةُ غَيْرِهِ مَعَهُ،\n",
          "en": "The greatest thing that Allaah commanded is Tawheed, which means: Singling Allaah out in worship. And the greatest thing that Allaah warned against is Shirk, which is: Supplicating to others along with Him.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى ﴿وَاعْبُدُواْ اللّهَ وَلاَ تُشْرِكُواْ بِهِ شَيْئ﴾<br />\n[النساء: 36].\n",
          "en": "The proof for this is (the meaning of) Allaah`s statement:\n“And worship Allaah [alone] and do not mix anything [in worship] with Him.”<br />\n&#8211; [Surah An-Nisaa: 36]\n"
        },
        {
          "ar": "فَإِذَا قِيلَ لَكَ: مَا الأُصُولُ الثَّلاثَةُ التِي يَجِبُ عَلَى الإِنْسَانِ مَعْرِفَتُهَا؟ فَقُلْ: مَعْرِفَةُ الْعَبْدِ رَبَّهُ، وَدِينَهُ، وَنَبِيَّهُ مُحَمَّدًا صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.\n",
          "en": "So if it said to you: What are the three fundamental principles that mankind is obligated to know? Then say: That the servant knows his Lord, his Religion and his Prophet Muhammad, (may the peace and blessings of Allaah be on him).\n"
        },
        {
          "ar": "فَإِذَا قِيلَ لَكَ: مَنْ رَبُّكَ؟ فَقُلْ: رَبِّيَ اللهُ الَّذِي رَبَّانِي، وَرَبَّى جَمِيعَ الْعَالَمِينَ بِنِعَمِهِ، وَهُوَ مَعْبُودِي لَيْسَ لِي مَعْبُودٌ سِوَاهُ؛.\n",
          "en": "So if it is said: Who is your Lord? Then say: My Lord is Allaah, the One who nurtured me and nurtured all of creation through His favours. And He is the One whom I worship, there being to me no (false) deity worshipped that is equal to Him.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى: ﴿الْحَمْدُ للَََّهِ رَبِّ الْعَالَمِينَ﴾ [الفاتحة: 2].<br />\nوَكُلُّ مَنْ سِوَى اللهِ عَالَمٌ، وَأَنَا وَاحِدٌ مِنْ ذَلِكَ الْعَالَمِ.\n",
          "en": "The proof for this is (the meaning of) Allaah`s statement:\n“All praise be to Allaah, Lord of the ‘Alameen [i.e. all of creation].”<br />\n[Surah Al-Faatihah: 1]\nThe word ‘Aalam refers to everything apart from Allaah, and I am part of that creation.\n"
        },
        {
          "ar": "فَإِذَا قِيلَ لَكَ: بِمَ عَرَفْتَ رَبَّكَ؟ فَقُلْ:<br />\nبِآيَاتِهِ وَمَخْلُوقَاتِهِ، وَمِنْ آيَاتِهِ: اللَّيْلُ، وَالنَّهَارُ، وَالشَّمْسُ، وَالْقَمَرُ، وَمِنْ مَخْلُوقَاتِهِ السَّمَاوَاتُ السَّبْعُ وَالأَرَضُونَ السَّبْعُ وَمَنْ فِيهِنَّ، وَمَا بَيْنَهُمَا؛\n",
          "en": "So if it is said to you: How did you come to know of your Lord? Then say: \nBy way of His signs and His creations. And among His signs are the night and the day, and the sun and the moon. And among His creations are the seven (levels of) heaven and the seven (levels of) earth, as well as whoever [and whatever] lies in them and between them.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى: ﴿وَمِنْ آيَاتِهِ اللَّيْلُ وَالنَّهَارُ وَالشَّمْسُ وَالْقَمَرُ لاَ تَسْجُدُوا لِلشَّمْسِ وَلاَ لِلْقَمَرِ وَاسْجُدُوا لِلَّهِ الَّذِي خَلَقَهُنَّ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ﴾ [فصلت: 37].\n",
          "en": "The proof for this is (the meaning of) Allaah`s statement:“And from among His signs are the night and the day, and the sun and the moon. Do not prostrate yourselves to the sun or to the moon, but rather prostrate yourselves to Allaah who created them, if it is He whom you truly worship.<br />\n&#8211; [Surah Fussilat: 37]\n"
        },
        {
          "ar": "وَقَوْلُهُ تَعَالَى:<br />\n﴿إِنَّ رَبَّكُمُ اللّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَى عَلَى الْعَرْشِ يُغْشِي اللَّيْلَ النَّهَارَ يَطْلُبُهُ حَثِيثاً وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ أَلاَ لَهُ الْخَلْقُ وَالأَمْرُ تَبَارَكَ اللّهُ رَبُّ الْعَالَمِينَ﴾ [الأعراف: 54].\n",
          "en": "And (the meaning of) His statement:“Verily, your Lord is Allaah, who created the heavens and the earth in six days, and then rose over the Throne. He brings the night as a cover over the day, which it follows rapidly. And He made the sun, the moon and the stars subjected to His Command. Surely, to Him belongs the Creation and the Command. Blessed is Allaah, Lord of the Worlds.”<br />\n&#8211; [Surah Al-A`raaf: 54]\n"
        },
        {
          "ar": "وَالرَّبُ هُوَ الْمَعْبُودُ،<br />\nوَالدَّلِيلُ قَوْلُهُ تَعَالَى: ﴿يَا أَيُّهَا النَّاسُ اعْبُدُواْ رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ * الَّذِي جَعَلَ لَكُمُ الأَرْضَ فِرَاشاً وَالسَّمَآء بِنَآءً وَأَنزَلَ مِنَ السَّمَآءِ مَآءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقاً لَّكُمْ فَلاَ تَجْعَلُواْ لِلّهِ أَندَاداً وَأَنتُمْ تَعْلَمُونَ ﴾ [البقرة: 21، 22]\n",
          "en": "The word Rabb (Lord) means One who is worshipped. The proof for this is (the meaning of) Allaah`s saying:\n“O mankind! Worship your Lord who created you and those before you, so that you may be dutiful to Him. He is the One who made the earth a resting place for you, and the sky as a canopy, and sent down water from the sky and brought forth therewith fruits as a provision for you. So do no set up rivals with Allaah in worship knowingly.” \n&#8211; [Surah Al-Baqarah: 21-22]\n"
        },
        {
          "ar": "قَالَ ابْنُ كَثِيرٍ ـ رَحِمَهُ اللهُ تَعَالَى:<br />\nالخَالِقُ لِهَذِهِ الأَشْيَاءَ هُوَ الْمُسْتَحِقُّ لِلْعِبَادَةِ.\n",
          "en": "Ibn Kather, may Allaah have mercy on him, said:\n“The creator of these things is the One who truly deserves to be worshipped.”\n"
        },
        {
          "ar": "وَأَنْوَاعُ الْعِبَادَةِ الَّتِي أَمَرَ اللهُ بِهَا مِثْلُ: الإِسْلامِ، وَالإِيمَانِ، وَالإِحْسَانِ، وَمِنْهُ: الدُّعَاءُ، وَالْخَوْفُ، وَالرَّجَاءُ، وَالتَّوَكُّلُ، وَالرَّغْبَةُ، وَالرَّهْبَةُ، وَالْخُشُوعُ، وَالْخَشْيَةُ، وَالإِنَابَةُ، وَالاسْتِعَانَةُ، وَالاسْتِعَاذَةُ، وَالاسْتِغَاثَةُ، وَالذَّبْحُ، وَالنَّذْرُ، وَغَيْرُ ذَلكَ مِنْ أَنْوَاعِ الْعِبَادَةِ الَّتِي أَمَرَ اللهُ بِهَا. كُلُّهَا للهِ تَعَالَى.\n",
          "en": "The types of worship that Allaah commanded, such as Islaam, Eemaan and Ihsaan, which includes: Supplication, Fear, Hope, Reliance, Longing, Dreading, Submissiveness, Awe, Repentance, Seeking Assistance, Seeking Refuge, Asking for Help, Offering Sacrifices and Making Oaths, and all of the other types of worship that Allaah commanded – all of these belong to Allaah, alone.\n"
        },
        {
          "ar": "وَالدَّلِيلُ: قَوْلُهُ تَعَالَى:<br />\n﴿وَأَنَّ الْمَسَاجِدَ لِلَّهِ فَلاَ تَدْعُوا مَعَ اللَّهِ أَحَداً ﴾ [الجن: 18].\n",
          "en": "The proof for this is (the meaning of) Allaah`s saying:\n“And the masaajid belong to Allaah, so do not call unto anyone along with Allaah.”<br />\n&#8211; [Surah Al-Jinn: 18]\n"
        },
        {
          "ar": "فَمَنْ صَرَفَ مِنْهَا شَيْئًا لِغَيْرِ اللهِ؛ فَهُوَ مُشْرِكٌ كَافِرٌ؛ وَالدَّلِيلُ:<br />\nقَوْلُهُ تَعَالَى: ﴿وَمَن يَدْعُ مَعَ اللَّهِ إلٰهاً آخَرَ لاَ بُرْهَانَ لَهُ بِهِ فَإِنَّمَا حِسَابُهُ عِندَ رَبِّهِ إِنَّهُ لاَ يُفْلِحُ الْكَافِرُونَ ﴾ [المؤمنون: 117].\n",
          "en": "Anyone who directs any part of that to anyone besides Allaah, then he is a mushrik (polytheist) kaafir (disbeliever).\nThe proof for this is (the meaning of) Allaah`s saying:\n“And whoever calls unto another god besides Allaah, of which he has no proof for, his reckoning is only with his Lord.  Surely, the disbelievers will not be successful.”<br />\n&#8211; [Surah Al-Mu`minoon: 117]\n"
        },
        {
          "ar": "وَفِي الْحَدِيثِ: ( الدُّعَاءُ مخ الْعِبَادَةِ ). وَالدَّلِيلُ: قَوْلُهُ تَعَالَى:<br />\n﴿وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ ﴾ [غافر: 60].\n",
          "en": "It is stated in a hadeeth: \n“The supplication is the core of worship.\n”The proof for this (i.e. supplication) is [the meaning of] Allaah`s saying:\n“And your Lord says: ‘Supplicate to Me, I will respond to you. Verily those who are too proud to worship Me will enter the Hellfire in disgrace.`”<br />\n &#8211; [Surah Ghaafir: 40]\n"
        },
        {
          "ar": "وَدَلِيلُ الْخَوْفِ: قَوْلُهُ تَعَالَى:<br />\n﴿فَلاَ تَخَافُوهُمْ وَخَافُونِ إِن كُنتُم مُّؤْمِنِينَ ﴾ [آل عمران: 175].\n",
          "en": "The proof for fear is (the meaning of) Allaah`s saying:“So do not fear them, but fear Me if you are true believers.”<br />\n&#8211; [Surah Aali ‘Imraan: 175]\n"
        },
        {
          "ar": "وَدَلِيلُ الرَّجَاءِ: قَوْلُهُ تَعَالَى:<br />\n﴿فَمَن كَانَ يَرْجُو لِقَاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلاً صَالِحاً وَلاَ يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَداً ﴾ [الكهف: 110].\n",
          "en": "The proof for Hope is (the meaning of) Allaah`s saying:\n“So whoever hopes to meet his Lord, then let him perform righteous deeds, and not mix anyone into the worship of his Lord.”<br />\n&#8211; [Surah Al-Kahf: 110]\n"
        },
        {
          "ar": "ودَلِيلُ التَّوَكُلِ: قَوْلُهُ تَعَالَى: ﴿وَعَلَى اللّهِ فَتَوَكَّلُواْ إِن كُنتُم مُّؤْمِنِينَ ﴾ [المائدة: 23].\n",
          "en": "The proof for Reliance is (the meaning of) Allaah`s saying:“And upon Allaah [alone] put your reliance if you are truly believers.”<br />\n&#8211; [Surah Al- Maa`idah: 23]\n"
        },
        {
          "ar": "وقوله: ﴿وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ﴾ [الطلاق: 3].\n",
          "en": "And (the meaning of) His saying:\n“And whoever relies upon Allaah, then He is sufficient for Him.”<br />\n&#8211; [Surah At-Talaaq: 3]\n"
        },
        {
          "ar": "وَدَلِيلُ الرَّغْبَةِ، وَالرَّهْبَةِ، وَالْخُشُوعِ: قَوْلُهُ تَعَالَى: ﴿إِنَّهُمْ كَانُوا يُسَارِعُونَ فِي الْخَيْرَاتِ وَيَدْعُونَنَا رَغَباً وَرَهَباً وَكَانُوا لَنَا خَاشِعِينَ ﴾ [الأنبياء: 90].\n",
          "en": "The proof for Longing and Dreading and Submissiveness is (the meaning of) Allaah`s saying:<br />\n“Verily, they used to rush to do good deeds, and they would call on Us, longing (His reward) and dreading (His punishment), and they used to humble themselves submissively before Us.”<br />\n&#8211; [Surah Al-Anbiyaa: 90]\n"
        },
        {
          "ar": "وَدَلِيلُ الْخَشْيَةِ: قَوْلُهُ تَعَالَى: ﴿فَلاَ تَخْشَوْهُمْ وَاخْشَوْنِي&#8230;﴾ الآية [البقرة: 150].\n",
          "en": "The proof for Repentance is (the meaning of) Allaah`s saying:\n“And turn to your Lord in repentance and submit to Him [as Muslims].”<br />\n&#8211; [Surah Az-Zumar: 54]\n"
        },
        {
          "ar": "وَدَلِيلُ الإِنَابَةِ: قَوْلُهُ تَعَالَى: ﴿وَأَنِيبُوا إِلَى رَبِّكُمْ وَأَسْلِمُوا لَهُ&#8230;﴾ الآية [الزمر: 54].\n",
          "en": "The proof for Repentance is (the meaning of) Allaah`s saying:\n“And turn to your Lord in repentance and submit to Him [as Muslims].”<br />\n&#8211; [Surah Az-Zumar: 54]\n"
        },
        {
          "ar": "وَدَلِيلُ الاسْتِعَانَةِ: قَوْلُهُ تَعَالَى: ﴿إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ﴾ [الفاتحة: 5].\n",
          "en": "The proof for Seeking Assistance is (the meaning of) Allaah`s saying:\n“You alone do we worship and in You alone do we seek assistance.”<br />\n&#8211; [Surah Al- Faatihah: 4]\n"
        },
        {
          "ar": "وَفِي الْحَدِيثِ: (&#8230;وإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللهِ).\n",
          "en": "And in the hadeeth: \n“When you ask for assistance then seek assistance in Allaah.”\n"
        },
        {
          "ar": "وَدَلِيلُ الاسْتِعَاذَةِ: قَوْلُهُ تَعَالَى: ﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴾ [الفلق: 1]. وَ﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴾ [الناس: 1].\n",
          "en": "The proof for Seeking Refuge is (the meaning of) Allaah`s saying:\n“Say: I seek refuge in the Lord of the Daybreak.” &#8211; [Surah Al-Falaq: 1] And:“Say: I seek refuge in the Lord of Mankind.”<br />\n &#8211; [Surah An-Naas: 1]\n"
        },
        {
          "ar": "وَدَلِيلُ الاسْتِغَاثَةِ: قَوْلُهُ تَعَالَى: ﴿إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ&#8230;﴾ الآية [الأنفال: 9].\n",
          "en": "The proof for Asking for Help is (the meaning of) Allaah`s saying:\n“And remember when you sought help from your Lord and He responded to you…”<br />\n&#8211; [Surah Al-Anfaal: 9]\n"
        },
        {
          "ar": "وَدَلِيلُ الذَّبْحِ: قَوْلُهُ تَعَالَى:<br />\n﴿قُلْ إِنَّنِي هَدَانِي رَبِّي إِلَى صِرَاطٍ مُّسْتَقِيمٍ دِيناً قِيَماً مِّلَّةَ إِبْرَاهِيمَ حَنِيفاً وَمَا كَانَ مِنَ الْمُشْرِكِينَ * قُلْ إِنَّ صَلاَتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلّهِ رَبِّ الْعَالَمِينَ * لاَ شَرِيكَ لَه وَبِذَلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ ُ﴾ [الأنعام: 161-163].\n",
          "en": "The proof for offering sacrifices is (the meaning of) Allaah`s saying:\n“Say: Verily my prayer, my sacrificial offerings, my living and my dying are for Allaah, Lord of the Worlds. He has no partner&#8230;”<br />\n&#8211; [Surah Al-An`aam: 162-163]\n"
        },
        {
          "ar": "وَمِنَ السُنَّةِ: (لعَنَ اللهُ مَنْ ذَبَحَ لِغَيْرِ اللهِ).\n",
          "en": "And from the Sunnah is:\n“May Allaah curse the one who offers a sacrifice to other than Allaah.”\n"
        },
        {
          "ar": "وَدَلِيلُ النَّذْرِ: قَوْلُهُ تَعَالَى:<br />\n﴿يُوفُونَ بِالنَّذْرِ وَيَخَافُونَ يَوْماً كَانَ شَرُّهُ مُسْتَطِيراً ﴾ [الإنسان: 7].\n",
          "en": "The proof for Making Oaths is (the meaning of) Allaah`s saying:\n“They are those who fulfill their vows and fear a Day whose evil will be widespread.”<br />\n&#8211; [Surah Al-Insaan: 7]\n"
        },
        {
          "ar": "الأصل الثاني: مَعْرِفَةُ دِينِ الإِسْلامِ بِالأَدِلَّةِ وَهُوَ: الاسْتِسْلامُ للهِ بِالتَّوْحِيدِ، وَالانْقِيَادُ لَهُ بِالطَّاعَةِ، وَالْبَرَاءَةُ مِنَ الشِّرْكِ وَأَهْلِهِ، وَهُوَ ثَلاثُ مَرَاتِبَ: الإسْلامُ، وَالإِيمَانُ، وَالإِحْسَانُ. وَكُلُّ مَرْتَبَةٍ لَهَا أَرْكَانٌ.\n",
          "en": "The Second Fundamental Principle: Knowing the Religion of Islaam, based on evidences. This (i.e. Islaam) means submitting to Allaah by way of Tawheed, surrendering one`s  (full) obedience to Him, and absolving oneself from Shirk and its people. This can be divided into three levels:<br />\n1. Islaam<br />\n2. Eemaan, and<br />\n3. Ihsaan<br />\nEach one of these levels has its own pillars.\n"
        },
        {
          "ar": "المرتبة الأولى: الإسلام فَأَرْكَانُ الإِسْلامِ خَمْسَةٌ: شَهَادَةُ أَن لا إلٰه إِلا اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَإِقَامُ الصَّلاةِ، وَإِيتَاءِ الزَّكَاةِ، وَصَوْمُ رَمَضَانَ، وَحَجُّ بَيْتِ اللهِ الْحَرَامِ.\n",
          "en": "The Level of Islaam: The pillars of Islaam are five:<br />\n(1) The testimony that there is no deity that has the right to be worshipped except Allaah, and that Muhammad is the Messenger of Allaah;<br />\n(2) Establishing the Prayer;<br />\n(3) Giving the Zakaat;<br />\n(4) Fasting in Ramadaan;<br />\n(5) Performing Hajj to Allaah`s Sacred House.\n"
        },
        {
          "ar": "فَدَلِيلُ الشَّهَادَةِ: قَوْلُهُ تَعَالَى:<br />\n﴿ شَهِدَ اللّهُ أَنَّهُ لاَ إلٰه إِلاَّ هُوَ وَالْمَلاَئِكَةُ وَأُوْلُواْ الْعِلْمِ قَآئِمَاً بِالْقِسْطِ لاَ إلٰه إِلاَّ هُوَ الْعَزِيزُ الْحَكِيمُ ﴾ [آل عمران، 18].\n",
          "en": "The proof for the testimony of Faith is (the meaning of) Allaah`s saying:\nAllaah bears witness that there is no deity that has the right to be worshipped except Him, and so do the angels and those who possess knowledge. He is always maintaining His creation with justice. None has the right to be worshipped but Him – the All-Mighty, the All-Wise.”<br />\n&#8211; [Surah Aali ‘Imraan: 18]\n"
        },
        {
          "ar": "وَمَعْنَاهَا: لا مَعْبُودَ بِحَقٍّ إلا اللهُ،\n",
          "en": "The meaning of it (i.e. the testimony of Faith) is (the meaning of His saying): There is no one that has the right to be worshipped except Allaah, alone.\n"
        },
        {
          "ar": "﴿لا إلٰه﴾ نَافِيًا جَمِيعَ مَا يُعْبَدُ مِنْ دُونِ اللهِ ﴿إِلا اللهُ﴾ مُثْبِتًا الْعِبَادَةَ للهِ وَحْدَهُ لا شَرِيكَ لَهُ فِي عِبَادَتِهِ، كَمَا أَنَّهُ لَيْسَ لَهُ شَرِيكٌ فِي مُلْكِهِ.\n",
          "en": "Laa Ilaaha negates everything that is worshipped besides Allaah, while IllaaAllaah affirms the worship of only Allaah, free from any partner being mixed in with His worship, just as there is no partner mixed in with His Dominion.\n"
        },
        {
          "ar": "وَتَفْسِيرُهَا: الَّذِي يُوَضِّحُهَا قَوْلُهُ تَعَالَى<br />\n﴿وَإِذْ قَالَ إِبْرَاهِيمُ لأَبِيهِ وَقَوْمِهِ إِنَّنِي بَرَآء مِّمَّا تَعْبُدُونَ * إِلاَّ الَّذِي فَطَرَنِي فَإِنَّهُ سَيَهْدِينِ * وَجَعَلَهَا كَلِمَةً بَاقِيَةً فِي عَقِبِهِ لَعَلَّهُمْ يَرْجِعُونَ ﴾ [الزخرف: 26 &#8211; 28].\n",
          "en": "An explanation of this, which will clarify it further, is found in (the meaning of) Allaah`s saying:\n“And remember when Ibraaheem said to his father and to his people:  ‘Verily, I am free from all that you worship – except for He who created Me, and verily He will guide me.` And He made it a statement that will endure among his offspring that they may turn back to.”<br />\n&#8211; [Surah Az-Zukhruf: 26-28]\n"
        },
        {
          "ar": "وقَوْلُهُ تَعَالَى:<br />\n﴿قُلْ يَا أَهْلَ الْكِتَابِ تَعَالَوْاْ إِلَى كَلَمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلاَّ نَعْبُدَ إِلاَّ اللّهَ وَلاَ نُشْرِكَ بِهِ شَيْئاً وَلاَ يَتَّخِذَ بَعْضُنَا بَعْضاً أَرْبَاباً مِّن دُونِ اللّهِ فَإِن تَوَلَّوْاْ فَقُولُواْ اشْهَدُواْ بِأَنَّا مُسْلِمُونَ ﴾ [آل عمران: 64].\n",
          "en": "And (the meaning of) Allaah`s saying:\n“Say: ‘O People of the Scripture (i.e. Jews and Christians)! Come to a word that is just between us and you – that we worship none but Allaah alone and that we associate no  partners with Him; and that none of us shall take others as lords besides Allaah.` Then if they turn away, say: ‘Bear witness that we are Muslims.`”<br />\n&#8211; [Surah Aali ‘Imraan: 64]\n"
        },
        {
          "ar": "وَدليلُ شَهَادَةِ أَنَّ مُحَمَّدًا رَسُولُ اللهِ: قَوْلُهُ تَعَالَى:<br />\n﴿ لَقَدْ جَآءكُمْ رَسُولٌ مِّنْ أَنفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيصٌ عَلَيْكُم بِالْمُؤْمِنِينَ رَؤُوفٌ رَّحِيمٌ ﴾ [التوبة: 128].\n",
          "en": "The proof for testifying that Muhammad is the Messenger of Allaah is (the meaning of) His saying:Verily there has come to you a Messenger from amongst yourselves. It grieves him that you should receive any injury or difficulty. He is anxious over you (to be guided) and he is full of kindness and mercy towards the believers.”<br />\n&#8211; [Surah At-Tawbah: 128]\n"
        },
        {
          "ar": "وَمَعْنَى شَهَادَة أَنَّ مُحَمَّدًا رَسُولُ اللهِ:<br />\nطَاعَتُهُ فِيمَا أَمَرَ، وَتَصْدِيقُهُ فِيمَا أَخْبَرَ، واجْتِنَابُ مَا نَهَى عَنْهُ وَزَجَرَ وأَلا يُعْبَدَ اللهُ إِلا بِمَا شَرَعَ.\n",
          "en": "The meaning of testifying that Muhammad is the Messenger of Allaah is: Obeying him in what he has commanded, believing him in what he has informed us of, avoiding what  he forbade and warned against, and not worshipping Allaah except by what he prescribed.\n"
        },
        {
          "ar": "وَدَلِيلُ الصَّلاةِ، وَالزَّكَاةِ، وَتَفْسِيرُ التَّوْحِيدِ: قَوْلُهُ تَعَالَى:<br />\n﴿وَمَا أُمِرُوا إِلاَّ لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَآءَ وَيُقِيمُوا الصَّلاةَ وَيُؤْتُوا الزَّكَاةَ وَذَلِكَ دِينُ الْقَيِّمَةِ ﴾ [البينة: 5].\n",
          "en": "The proof for Prayer and Zakaat and the explanation of Tawheed is found in (the meaning of) Allaah`s saying:\n“And they were not commanded except that they should worship Allaah, making the religion (i.e. worship) solely for Him alone, and that they should perform the prayer and give the Zakaat. And that is the right Religion.” &#8211; [Surah Al-Bayyinah: 5]\n"
        },
        {
          "ar": "ودَلِيلُ الصِّيَامِ: قَوْلُهُ تَعَالَى:<br />\n﴿يَا أَيُّهَا الَّذِينَ آمَنُواْ كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ ﴾ [البقرة: 183].\n",
          "en": "The proof for Fasting is (the meaning of) Allaah`s saying:\n“O you who believe! Fasting is prescribed for you just as it was prescribed for those before you, in order that you may acquire Taqwaa (dutifulness to Allaah).”<br />\n&#8211; [Surah Al-Baqarah: 183]\n"
        },
        {
          "ar": "ودَلِيلُ الْحَجِّ: قَوْلُهُ تَعَالَى:<br />\n﴿وَلِلّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلاً وَمَن كَفَرَ فَإِنَّ الله غَنِيٌّ عَنِ الْعَالَمِينَ ﴾ [آل عمران: 97].\n",
          "en": "The proof for Hajj is (the meaning of) Allaah`s saying:\nAnd the Hajj (pilgrimage) to the House (Ka`bah) is a duty that mankind owes to Allaah for those who are able to do it. And whoever disbelieves (by denying Hajj), then indeed  Allaah is not in need of any of His creation.”<br />\n&#8211; [Surah Aali ‘Imraan: 97]\n"
        },
        {
          "ar": "الْمَرْتَبَةُ الثَّانِيَةُ:<br />\nالإِيمَانُ وَهُوَ: بِضْعٌ وَسَبْعُونَ شُعْبَةً، فَأَعْلاهَا قَوْلُ لا إلٰه إِلا اللهُ، وَأَدْنَاهَا إِمَاطَةُ الأَذَى عَنِ الطَّرِيقِ، وَالْحَيَاءُ شُعْبَةٌ مِنْ الإِيمَانِ.\n",
          "en": "The Level of Eemaan: \nEemaan consists of more than seventy branches. The highest of them is saying Laa Ilaaha IllaaAllaah and the lowest of them is moving a harmful object from the road. And Hayaa (modesty) is a branch from Eemaan.\n"
        },
        {
          "ar": "وَأَرْكَانُهُ سِتَّةٌ:<br />\nكما فى الحديث (أَنْ تُؤْمِنَ بِاللهِ، وَمَلائِكَتِهِ،  وَكُتُبِهِ، وَرُسُلِهِ، وَالْيَوْمِ الآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ).\n",
          "en": "Its pillars are six: \n(1) That you believe in Allaah,<br />\n(2) His angels,<br />\n(3) His books,<br />\n(4) His Messengers,<br />\n(5) the Last Day, and<br />\n(6) that you believe in Al-Qadar (Divine Pre- Decree) – the good of it and the bad of it.\n"
        },
        {
          "ar": "وَالدَّلِيلُ عَلَى هَذِهِ الأَرْكَانِ السِّتَةِ: قَوْلُهُ تَعَالَى:<br />\n﴿ لَّيْسَ الْبِرَّ أَن تُوَلُّواْ وُجُوهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلَـكِنَّ الْبِرَّ مَنْ آمَنَ بِاللّهِ وَالْيَوْمِ الآخِرِ وَالْمَلآئِكَةِ وَالْكِتَابِ وَالنَّبِيِّينَ﴾ [البقرة: 177].\n",
          "en": "The proof for these six pillars is Allaah`s statement:\n“Righteousness (birr) is not that you turn your faces towards the east and the west (in prayer), but rather righteousness (birr) is (for) the one who believes in Allaah, the Last Day, the Angels, the Books and the Prophets.”<br />\n&#8211; [Surah Al- Baqarah: 177]\n"
        },
        {
          "ar": "ودليل القدر: قَوْلُهُ تَعَالَى:<br />\n﴿إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ ﴾ [القمر: 49].\n",
          "en": "And the proof for Al-Qadar (Pre-Decree) is Allaah`s saying:\n“Verily, We have created all things with Qadar (divine pre-decree ordained for it).”<br />\n&#8211; [Surah Al-Qamar: 49]\n"
        },
        {
          "ar": "الْمَرْتَبَةُ الثَّالِثَةُ:<br />\nالإِحْسَانُ رُكْنٌ وَاحِدٌ. و هو أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ، فَإِن لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ .\n",
          "en": "The Level of Ihsaan: Ihsaan is one pillar, which means: To worship Allaah as if you see Him, but even if you don`t see Him, He indeed sees you.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\n﴿ إِنَّ اللّـهَ مَعَ الّـَذِينَ اتَّقَواْ وَّالّـَذِينَ هُم مُّحْسِنُونَ ﴾ [النحل: 128].\n",
          "en": "The proof for this is (the meaning of) Allaah`s saying:\n“Verily, Allaah is with those who have Taqwaa (dutifulness to Allaah) and those who have Ihsaan.”<br />\n&#8211; [Surah An-Nahl: 128]\n"
        },
        {
          "ar": "وقَوْلُهُ تَعَالَى:<br />\n﴿وَتَوَكَّلْ عَلَى الْعَزِيزِ الرَّحِيمِ * الَّذِي يَرَاكَ حِينَ تَقُومُ * وَتَقَلُّبَكَ فِي السَّاجِدِينَ * إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ ﴾ [الشعراء: 217 ـ 220].\n",
          "en": "And (the meaning of) His saying:\n“And put your trust in the All-Mighty, the Most Merciful, who sees you when you stand up (for prayer at night), and (who sees) your movements among those who prostrate themselves (to Him). Verily, He is the All-Hearer, the All-Knower.”<br />\n&#8211; [Surah Ash-Shu`araa: 217-220]\n"
        },
        {
          "ar": "وقَوْلُهُ تَعَالَى:<br />\n﴿وَمَا تَكُونُ فِي شَأْنٍ وَمَا تَتْلُو مِنْهُ مِن قُرْآنٍ وَلاَ تَعْمَلُونَ مِنْ عَمَلٍ إِلاَّ كُنَّا عَلَيْكُمْ شُهُوداً إِذْ تُفِيضُونَ فِيهِ﴾ [يونس: 61].\n",
          "en": "And (the meaning of) His saying:\n“There is no deed that you (O Muhammad) do, nor any portion of the Qur`aan that you recite, nor any deed that you (humans) do, except that We are witnesses to it, whilst you are doing it.”<br />\n&#8211; [Surah Yoonus: 61]\n"
        },
        {
          "ar": "وَالدَّلِيلُ مِنَ السُّنَّةِ: حَدِيثُ جِبْرِيلَ الْمَشْهُورُ: عَنْ عُمَرَ بنِ الْخَطَّابِ ـ رَضِيَ اللهُ عَنْهُ ـ قَالَ:<br />\nبَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ النَّبِيِّ ـ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ـ إِذْ طَلَعَ عَلَيْنَا رَجُلٌ، شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعْرِ، لا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلا يَعْرِفُهُ مِنَّا أَحَدٌ، فَجَلَسَ إِلَى النَّبِيِّ ـ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ـ فَأَسْنَدَ رُكْبَتَيْهِ إِلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ&#8230;\n",
          "en": "The proof from the Sunnah is the famous hadeeth of Jibreel, which is reported from  ‘Umar bin Al-Khattaab who said: \n“One day we were sitting with the Prophet when there appeared to us a man with extremely white garments and extremely black hair. No trace of journeying could be seen on him nor did any amongst us recognize him. Then he sat in front of the Prophet, lining up his knees with his knees and placing his palms upon his thighs&#8230;&#8221;\n"
        },
        {
          "ar": "&#8230;وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الإِسْلامِ فَقَالَ: ( أَنْ تَشْهَدَ أَنْ لا إلٰه إِلا اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَتُقِيمَ الصَّلاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إِنْ اسْتَطَعْتَ إِلَيْهِ سَبِيلا ). قَالَ: صَدَقْتَ&#8230;\n",
          "en": "&#8230;and said: ‘O Muhammad, inform me about Islaam.` So he said: ‘It is that you testify that there is no deity that has the right to be worshipped except Allaah and that Muhammad is the Messenger of Allaah. And that you establish the prayer, give the Zakaat, fast during Ramadaan and perform the Hajj (pilgrimage) to (Allaah`s) House, if you are able to do it.` He said: ‘You have spoken truthfully.`\n"
        },
        {
          "ar": "&#8230;فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ. قَالَ: أَخْبِرْنِي عَنِ الإِيمَانِ. قَالَ:(أَنْ تُؤْمِنَ بِاللهِ، وَمَلائِكَتِهِ، وَكُتُبِهِ، وَرُسُلِهِ، وَالْيَوْمِ الآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ ). قَالَ: صَدَقْتَ&#8230;\n",
          "en": "&#8230;So we were amazed that he had asked him and then told him that he was truthful. Then he said: ‘Now inform me about Eemaan.` So he said: ‘It is that you believe in Allaah, His angels, His (revealed) books, His messengers, the Last Day, and that you believe in Al-Qadar , the good of it and the bad of it.` He said: ‘You have spoken truthfully&#8230;\n"
        },
        {
          "ar": "&#8230;قَالَ: أَخْبِرْنِي عَنِ الإِحْسَانِ. قَالَ: ( أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ )&#8230;\n",
          "en": "&#8230;Now inform me about Ihsaan. He said: ‘It is that you worship Allaah as if you see Him, but even though you don`t see Him, He indeed sees you.`&#8230;\n"
        },
        {
          "ar": "&#8230;قَالَ: أَخْبِرْنِي عَنِ السَّاعَةِ. قَالَ: (مَا الْمَسْؤُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ )&#8230;\n",
          "en": "&#8230;He then said: ‘Now inform me about the (Final) Hour.` He said: ‘The one who is being asked does not have any more knowledge of it than the one who is asking.`&#8230;\n"
        },
        {
          "ar": "&#8230;قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا. قَالَ: ( أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ )&#8230;\n",
          "en": "&#8230;He said: ‘So then inform me about its signs.` He said: ‘It will be when the mother gives birth to her (female) master, when the barefooted, barren and lowly shepherds will compete with one another in constructing tall buildings.`&#8230;\n"
        },
        {
          "ar": "&#8230;قَالَ: فَمَضَى، فَلَبِثْنَا مَلِيَّا، فَقَالَ: ( يَا عُمَرُ أَتَدْرُونَ مَنِ السَّائِلِ؟ ). قُلْت: اللهُ وَرَسُولُهُ أَعْلَمُ، قَالَ: ( هَذَا جِبْرِيلُ أَتَاكُمْ  يُعَلِّمُكُمْ أَمْرَ دِينِكُم).\n",
          "en": "&#8230;Then he left and we remained (seated) there for a while.Then he said: ‘O ‘Umar, do you know who the questioner was?` I said: ‘Allaah and His Messenger know best.` He said: ‘That was Jibreel who came to you to teach you your Religion.` ”\n"
        },
        {
          "ar": "الأصل الثالث:<br />\nمَعْرِفَةُ نَبِيِّكُمْ مُحَمَّدٍ ـ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ عَبْدِ الْمُطَّلِبِ بْنِ هَاشِمٍ، وَهَاشِمٌ مِنْ قُرَيْشٍ، وَقُرَيْشٌ مِنَ الْعَرَبِ، وَالْعَرَبُ مِنْ ذُرِّيَّةِ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ الْخَلِيلِ عَلَيْهِ وَعَلَى نَبِيِّنَا أَفْضَلُ الصَّلاةِ وَالسَّلامِ.\n",
          "en": "The Third Principle:\nKnowledge of your Prophet, Muhammad ﷺ : He is Muhammad, the son of ‘Abdullaah, the son of ‘Abdul-Mutallib bin Haashim. Haashim was from the (the tribe of) Quraysh and Quraysh was from the Arabs. And the Arabs are from the offspring of (Prophet) Isma`eel, son of (Prophet) Ibraaheem. May Allaah send the best of His peace and blessings on him and on our Prophet (Muhammad).\n"
        },
        {
          "ar": "وَلَهُ مِنَ الِعُمُرِ ثَلاثٌ وَسِتُّونَ سَنَةً، مِنْهَا أَرْبَعُونَ قَبْلَ النُّبُوَّةِ، وَثَلاثٌ وَعِشْرُون َفى النبوة.<br />\nنُبِّئَ ب﴿اقْرَأ﴾ ،<br />\nوَأُرْسِلَ ب﴿الْمُدَّثِّرْ﴾\n",
          "en": "He lived for sixty-three years, forty of which was prior to his prophethood and twenty-three of which he spent as a prophet, messenger. He became a prophet due to (the meaning of Allaah`s saying):\n“Read”<br />\n&#8211; [Surah ‘Alaq: 1] \nand a messenger due to: \n“O you wrapped in garments.”<br />\n&#8211; [Surah Al-Muddathir: 1]\n"
        },
        {
          "ar": "وَبَلَدُهُ مَكَّةُ، بَعَثَهُ اللهُ بِالنِّذَارَةِ عَنِ الشِّرْكِ، وَبالَدْعُوة إِلَى التَّوْحِيدِ،\n",
          "en": "His homeland was Makkah, and he (later) migrated to Madeenah. Allaah sent him to warn against Shirk (polytheism) and to call to Tawheed (pure monotheism).\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\n﴿يَا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنذِرْ * وَرَبَّكَ فَكَبِّرْ * وَثِيَابَكَ فَطَهِّرْ * وَالرُّجْزَ فَاهْجُرْ * وَلاَ تَمْنُن تَسْتَكْثِرُ * وَلِرَبِّكَ فَاصْبِرْ ﴾ [المدثر: 1-7].\n",
          "en": "The proof for this is (the meaning of) Allaah`s saying:\n“O you wrapped in garments. Rise and warn! And magnify your Lord (Allaah). And purify your garments. And abandon ar-rujz (idols). And do not give away something in order to have more. And be patient for the sake of your Lord.”<br />\n&#8211; [Surah Al-Muddathir: 1-7]\n"
        },
        {
          "ar": "وَمَعْنَى: ﴿ قُمْ فَأَنذِرْ ﴾ : يُنْذِرُ عَنِ الشِّرْكِ، وَيَدْعُو إِلَى التَّوْحِيدِ.<br />\n﴿ وَرَبَّكَ فَكَبِّرْ ﴾ : أَيْ: عَظِّمْهُ بِالتَّوْحِيدِ.<br />\n﴿ وَثِيَابَكَ فَطَهِّرْ ﴾ : أَيْ: طَهِّرْ أَعْمَالَكَ عَنِ الشِّرْكِ.<br />\n﴿ وَالرُّجْزَ فَاهْجُرْ ﴾ : الرُّجْزَ: الأَصْنَامُ، وَهَجْرُهَا: تَرْكُهَا، وَالْبَرَاءَةُ مِنْهَا وَأَهْلُهَا\n",
          "en": "The meaning of “Rise and warn” is warn against Shirk and call to Tawheed. \n“And magnify your Lord” means glorify Him by way of Tawheed. \n“And purify your garments” means cleanse your actions from Shirk. \n“And abandon ar-rujz.” “Rujz” means statues, and “Abandon” means leave them and free yourself from them and those who worship them.\n"
        },
        {
          "ar": "أَخَذَ عَلَى هَذَا عَشْرَ سِنِينَ يَدْعُو إِلَى التَّوْحِيدِ، وَبَعْدَ الْعَشْرِ عُرِجَ بِهِ إِلَى السَّمَاءِ، وَفُرِضَتْ عَلَيْهِ الصَّلَواتُ الْخَمْسُ، وَصَلَّى فِي مَكَّةَ ثَلاثَ سِنِينَ، وَبَعْدَهَا أُمِرَ بالْهِجْرَةِ إِلَى الْمَدِينَةِ،\n",
          "en": "He remained doing this for ten years, calling the people to Tawheed. And after ten years, he was ascended up to the heaven, where the five daily prayers were made obligatory on him. So he prayed in Makkah for three years and thereafter, he was ordered to make the Hijrah (migration) to Madeenah.\n"
        },
        {
          "ar": "وَالْهِجْرَةُ الانْتِقَالُ مِنْ بَلَدِ الشِّرْكِ إِلَى بَلَدِ الإِسْلامِ. وَالْهِجْرَةُ فَرِيضَةٌ عَلَى هَذِهِ الأُمَّةِ مِنْ بَلَدِ الشِّرْكِ إِلَى بلد الإِسْلامِ، وَهِيَ بَاقِيَةٌ إِلَى أَنْ تَقُومَ السَّاعَةُ،\n",
          "en": "Hijrah means Moving from a land of Shirk to a land of Islaam. It is obligatory upon this ummah to migrate from a land of Shirk to a land of Islaam, and this is everlasting until the (Final) Hour is established.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\n﴿ إِنَّ الَّذِينَ تَوَفَّاهُمُ الْمَلآئِكَةُ ظَالِمِي أَنْفُسِهِمْ قَالُواْ فِيمَ كُنتُمْ قَالُواْ كُنَّا مُسْتَضْعَفِينَ فِي الأَرْضِ قَالْوَاْ أَلَمْ تَكُنْ أَرْضُ اللّهِ وَاسِعَةً فَتُهَاجِرُواْ فِيهَا فَأُوْلَـئِكَ مَأْوَاهُمْ جَهَنَّمُ وَسَآءتْ مَصِيراً * إِلاَّ الْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَآء وَالْوِلْدَانِ لاَ يَسْتَطِيعُونَ حِيلَةً وَلاَ يَهْتَدُونَ سَبِيلاً * فَأُوْلَـئِكَ عَسَى اللّهُ أَن يَعْفُوَ عَنْهُمْ وَكَانَ اللّهُ عَفُوّاً غَفُوراً ﴾ [النساء: 97ـ99].\n",
          "en": "The proof for this is (the meaning of) Allaah`s saying:\n“Verily, as for those whom  the angels take (in death) while they are wronging themselves (by not performing Hijrah), they (angels) will say (to them): “In what (condition) were you? ” They will reply: “We were weak and oppressed in the earth.” They (angels) will say: “Was not the earth of Allaah spacious enough for you to migrate therein?” Such men will find their abode in Hell – what an evil destination! Except the weak ones among men, and women and children – who cannot devise a plan, nor are they able to direct their way. These are the ones whom Allaah is (most) likely to forgive, and Allaah is Ever Oft-Pardoning, Most Forgiving.”<br />\n&#8211; [Surah An-Nisaa: 97-99]\n"
        },
        {
          "ar": "وَقَوْلُهُ تَعَالَى:<br />\n﴿ يَا عِبَادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي وَاسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ ﴾ [العنكبوت: 56].\n",
          "en": "And (the meaning of) Allaah`s saying:“O My servants who believe (in Me)! Verily, My earth is spacious so to Me alone, perform your worship.<br />\n&#8211; [Surah Al-‘Ankaboot: 56]”\n"
        },
        {
          "ar": "قَالَ الْبُغَوِيُّ ـ رَحِمَهُ اللهُ ـ<br />\n:نزلت هَذِهِ الآيَةِ فِي المُسْلِمِينَ الَّذِينَ بِمَكَّةَ ولَمْ يُهَاجِرُوا، نَادَاهُمُ اللهُ بِاسْمِ الإِيمَانِ.\n",
          "en": "Al-Baghawee, may Allaah have mercy on him, said: \n“The reason for the revelation of this ayah was due to some Muslims who had resided in Makkah and did not migrate (to Madeenah). Allaah called out to them using the title of Eemaan (for them).”\n"
        },
        {
          "ar": "وَالدَّلِيلُ عَلَى الْهِجْرَةِ مِنَ السُّنَّةِ: قَوْلُهُ ـ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ـ:<br />\n(لا تَنْقَطِعُ الْهِجْرَةُ حَتَّى تَنْقَطِعَ التَّوْبَةُ، وَلا تَنْقَطِعُ التَّوْبَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا).\n",
          "en": "The proof for Hijrah from the Sunnah is his saying: \n“Hijrah will not cease until repentance ceases. And repentance will not cease (to be accepted) until the sun rises from where it sets (i.e. the west).”\n"
        },
        {
          "ar": "فَلَمَّا اسْتَقَرَّ فِي الْمَدِينَةِ أُمِرَ بِبَقِيَّةِ شَرَائِعِ الإِسْلامِ، مِثلِ:<br />\nالزَّكَاةِ، وَالصَّوْمِ، وَالْحَجِّ، وَالأَذَانِ، وَالْجِهَادِ، وَالأَمْرِ بِالْمَعْرُوفِ وَالنَّهْيِ عَنِ الْمُنْكَرِ، وَغَيْرِ ذَلِكَ مِنْ شَرَائِعِ الإِسْلامِ، أَخَذَ عَلَى هَذَا عَشْرَ سِنِينَ، وَتُوُفِّيَ ـ صَلواتُ اللهِ وَسَلامُهُ عَلَيْهِ ـ وَدِينُهُ بَاقٍ.\n",
          "en": "So when he settled in Madeenah, he commanded all of the remaining Laws of Islaam, such as Zakaat, Fasting, Hajj, Adhaan, Jihaad, commanding good and forbidding evil, as well as the other laws of Islaam. He remained doing this for ten years, and then passed away, peace and blessings of Allaah be on him, while his Religion remained.\n"
        },
        {
          "ar": "وَهَذَا دِينُهُ، لا خَيْرَ إِلا دَلَّ الأُمَّةَ عَلَيْهِ، وَلا شَرَّ إِلا حَذَّرَهَا مِنْهُ، وَالْخَيْرُ الَّذِي دَلَّهَا عَلَيْهِ التَّوْحِيدُ، وَجَمِيعُ مَا يُحِبُّهُ اللهُ وَيَرْضَاهُ، وَالشَّرُ الَّذِي حَذَّرَهَا مِنْهُ الشِّرْكُ، وَجَمِيعُ مَا يَكْرَهُ اللهُ وَيَأْبَاهُ. بَعَثَهُ اللهُ إِلَى النَّاسِ كَافَّةً، وَافْتَرَضَ طَاعَتَهُ عَلَى جَمِيعِ الثَّقَلَيْنِ الْجِنِّ وَالإِنْسِ؛\n",
          "en": "This was his Religion – there was no good except that he directed his ummah towards it, and there was no evil except that he warned them against it. The good that he directed his ummah to was: Tawheed and everything that Allaah loves and is pleased with. The evil that he warned his ummah about was: Shirk and everything that Allaah hates and rejects. Allaah sent him to all of mankind, and He made it an obligation upon everyone from the two species of Jinn and mankind to obey him.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى: ﴿ قُلْ يَا أَيُّهَا النَّاسُ إِنِّي رَسُولُ اللّهِ إِلَيْكُمْ جَمِيع﴾ [الأعراف: 158].\n",
          "en": "The proof for this is (the meaning of) Allaah`s saying:\n“Say: ‘O people! Verily, I am the Messenger of Allaah sent to all of you.`”<br />\n&#8211; [Surah Al-A`raaf: 158]\n"
        },
        {
          "ar": "وَكَمَّلَ اللهُ بِهِ الدِّينَ؛ وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\n﴿ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلاَمَ دِين﴾ [المائدة: 3].\n",
          "en": "Allaah perfected and completed his Religion through him. The proof for this is (the meaning of) Allaah`s saying:\nThis day I have completed your Religion for you, and perfected my Favor upon you. And I am pleased with Islaam as a Religion for you.<br />\n&#8211; [Surah Al-Maa`idah: 3]\n"
        },
        {
          "ar": "وَالدَّلِيلُ عَلَى مَوْتِهِ ـ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ـ قَوْلُهُ تَعَالَى:<br />\n﴿ إِنَّكَ مَيِّتٌ وَإِنَّهُم مَّيِّتُونَ * ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ عِندَ رَبِّكُمْ تَخْتَصِمُونَ ﴾ [الزمر: 30، 31].\n",
          "en": "The proof that he died is (the meaning of) Allaah`s saying:\n“You will surely die and they too will surely die. Then on the Day of Recompense, you will be disputing before your Lord.”<br />\n&#8211; [Surah Az-Zumar: 30-31]\n"
        },
        {
          "ar": "وَالنَّاسُ إِذَا مَاتُواْ يُبْعَثُونَ؛ وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\n﴿ مِنْهَا خَلَقْنَاكُمْ وَفِيهَا نُعِيدُكُمْ وَمِنْهَا نُخْرِجُكُمْ تَارَةً أُخْرَى ﴾ [طه: 55].\n",
          "en": "When people die they will be resurrected. The proof for this is Allaah`s saying:\n“From it (the earth) We created you, and to it We shall return you, and from it We shall bring you out once again.”<br />\n&#8211; [Surah TaHa: 55]\n"
        },
        {
          "ar": "وقَوْلُهُ تَعَالَى:<br />\n﴿ وَاللَّهُ أَنبَتَكُم مِّنَ الأَرْضِ نَبَاتاً * ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجاً ﴾ [نوح: 17، 18].\n",
          "en": "And (the meaning of) Allaah`s saying:\n“Allaah has brought you forth from the earth. Afterwards, He will return you into it and (then) bring you forth (once again, i.e. resurrection).”<br />\n&#8211; [Surah Nooh: 17-18]\n"
        },
        {
          "ar": "وَبَعْدَ الْبَعْثِ مُحَاسَبُونَ وَمَجْزِيُّونَ بِأَعْمَالِهِمْ، وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\n﴿ وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ لِيَجْزِيَ الَّذِينَ أَسَاؤُوا بِمَا عَمِلُوا وَيَجْزِيَ الَّذِينَ أَحْسَنُوا بِالْحُسْنَى ﴾ [النجم: 31].\n",
          "en": "After being resurrected, they will be judged and recompensed for their actions. The proof for this is (the meaning of) Allaah`s saying:\n“&#8230;that He may recompense those who do evil with that which they have done (i.e. Hellfire), and reward those who do good with what is best (i.e. Paradise).” &#8211; [Surah An-Najm: 31]\n"
        },
        {
          "ar": "وَمَنْ كَذَّبَ بِالْبَعْثِ كَفَرَ، وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\n﴿ زَعَمَ الَّذِينَ كَفَرُوا أَن لَّن يُبْعَثُوا قُلْ بَلَى وَرَبِّي لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ وَذَلِكَ عَلَى اللَّهِ يَسِيرٌ ﴾ [التغابن: 7].\n",
          "en": "Whoever rejects the resurrection, disbelieves. The proof for this is (the meaning of) Allaah`s saying:\n“The disbelievers claim they will never be resurrected. Say (O Muhammad): ‘Yes, by my Lord! You will certainly be resurrected then you will be informed of what deeds you did.` And that is easy for Allaah.”<br />\n&#8211; [Surah At-Taghaabun: 7]\n"
        },
        {
          "ar": "وَأَرْسَلَ اللهُ جَمِيعَ الرُّسُلِ مُبَشِّرِينَ وَمُنْذِرِينَ؛ وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\n﴿ رُّسُلاً مُّبَشِّرِينَ وَمُنذِرِينَ لِئَلاَّ يَكُونَ لِلنَّاسِ عَلَى اللّ حُجَّةٌ بَعْدَ الرُّسُلِ﴾ [النساء: 165].\n",
          "en": "Allaah sent all of the messengers, giving good tidings and warning. The proof for this is (the meaning of) Allaah`s saying:\n“Messengers bearing good news and warning – in order that mankind could have no plea against Allaah after (the coming of) the Messengers.”<br />\n&#8211; [Surah An- Nisaa: 165]\n"
        },
        {
          "ar": "وأَّولُهُمْ نُوحٌ عَلَيْهِ السَّلامُ، وَآخِرُهُمْ مُحَمَّدٌ ـ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ـ وَهُوَ خَاتَمُ النَّبِيِّينَ؛ وَالدَّلِيلُ عَلَى أَنَّ أَوَّلَهُمْ نُوحٌ قَوْلُهُ تَعَالَى:<br />\n﴿ إِنَّا أَوْحَيْنَا إِلَيْكَ كَمَا أَوْحَيْنَا إِلَى نُوحٍ وَالنَّبِيِّينَ مِن بَعْدِهِ ﴾ [النساء:163].\n",
          "en": "The first of them was Nooh and the last of them was Muhammad, who was the Seal of the Prophets. The proof that Nooh was the first of them is Allaah`s saying:\n“Verily, We sent the revelation to you (O Muhammad), just as We sent the revelation to Nooh and the prophets after him.” [Surah An-Nisaa: 163]\n"
        },
        {
          "ar": "وَكُلُّ أُمَّةٍ بَعَثَ اللهُ إِلَيْهِا رَسُولا مِنْ نُوحٍ إِلَى مُحَمَّدٍ ـ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ـ يَأْمُرُهُمْ بِعِبَادَةِ اللهِ وَحْدَهُ، وَيَنْهَاهُمْ عَنْ عِبَادَةِ الطَّاغُوتِ؛\n",
          "en": "Every nation that Allaah sent a messenger to, from Nooh up to Muhammad, he (i.e. the messenger) would command them to worship Allaah alone and forbid them from worshipping the Taaghoot.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\n﴿ وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَّسُولاً أَنِ اعْبُدُواْ اللّهَ وَاجْتَنِبُواْ الطَّاغُوتَ﴾ [النحل: 36].<br />\nوَافْتَرَضَ اللهُ عَلَى جَمِيعِ الْعِبَادِ الْكُفْرَ بِالطَّاغُوتِ وَالإِيمَانَ بِاللهِ.\n",
          "en": "The proof for this is Allaah`s saying:“And We have indeed sent a messenger to every nation (saying): \n”Worship Allaah (alone) and avoid the false deities (Taaghoot).”<br />\n&#8211; [Surah An-Nahl: 36]\nAllaah obligated all of His servants to disbelieve in the Taaghoot and believe in Allaah.\n"
        },
        {
          "ar": "قَالَ ابْنُ الْقَيِّمِ ـ رَحِمَهُ اللهُ تَعَالَى:<br />\nمَعْنَى الطَّاغُوتِ مَا تَجَاوَزَ بِهِ الْعَبْدُ حَدَّهُ مِنْ مَعْبُودٍ أَوْ مَتْبُوعٍ أَوْ مُطَاعٍ.\n",
          "en": "Ibn Al-Qayyim, may Allaah have mercy on him, said: “The Taaghoot is someone or something for whose sake a worshipper transgresses limits, such as those who are worshipped, followed or obeyed.”\n"
        },
        {
          "ar": "وَالطَّوَاغِيتُ كَثِيرُونَ وَرُؤُوسُهُمْ خَمْسَةٌ: إِبْلِيسُ لَعَنَهُ اللهُ، وَمَنْ عُبِدَ وَهُوَ رَاضٍ، وَمَنْ دَعَا النَّاسَ إِلَى عِبَادَةِ نَفْسِهِ، وَمَنْ ادَّعَى شَيْئًا مِنْ عِلْمِ الْغَيْبِ، وَمَنْ حَكَمَ بِغَيْرِ مَا أَنْزَلَ اللهُ؛\n",
          "en": "The Tawaagheet (pl. of Taaghoot) are many, but their heads are five: \n(1) Iblees (the Devil), may Allaah curse him;<br />\n(2) whoever is worshipped while being pleased with that;<br />\n(3) whoever calls the people to worship himself;<br />\n(4) whoever claims to have knowledge of the Unseen, and<br />\n(5) whoever rules by other than what Allaah has revealed.\n"
        },
        {
          "ar": "وَالدَّلِيلُ قَوْلُهُ تَعَالَى:<br />\n﴿ لاَ إِكْرَاهَ فِي الدِّينِ قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ فَمَنْ يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِن بِاللّهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىَ لاَ انفِصَامَ لَهَا وَاللّهُ سَمِيعٌ عَلِيمٌ ﴾ [البقرة: 256].<br />\nوَهَذَا هُوَ مَعْنَى لا إلٰه إِلا اللهُ،\n",
          "en": "The proof for this is (the meaning of ) Allaah`s saying:\n“There is no compulsion in the Religion. Verily, the right path has become distinct from the wrong path. So whoever disbelieves in the Taaghoot and believes in Allaah, then he has taken hold of the firmest handhold that will never break. And Allaah is the All-Hearer, the All-Knower.”<br />\n&#8211; [Surah Al-Baqarah: 256]\nThis is what is meant by the statement Laa Ilaaha IllaaAllaah.\n"
        },
        {
          "ar": "وَفِي الْحَدِيثِ: ( رَأْسُ الأَمْرِ الإِسْلامِ، وَعَمُودُهُ الصَّلاةُ، وَذِرْوَةُ سَنَامِهِ الْجِهَادُ فِي سَبِيلِ اللهِ). وَاللهُ أَعْلَمُ. وَصَلَّى اللهُ عَلَى مُحَمَّدٍ وَعلى آلٰه وَصَحْبِهِ وَسَلَّمَ.\n",
          "en": "And in the hadeeth: “The head of the matter is Islaam and its main pillar is the Prayer. And its highest part is Jihaad in the Cause of Allaah.” And Allaah knows best. May Allaah send His peace and blessings on Muhammad ﷺ, his family and his Companions.\n"
        }
      ]
    }
  },
  {
    "al-waajibaat-al-mutahattimat": {
      "category_id": 10,
      "title": "Al-Waajibaat Al-Mutahattimat",
      "slug": "al-waajibaat-al-mutahattimat",
      "content": [
        {
          "ar": "متن شروط لا إله إلا الله\n",
          "en": "The Conditions of Laa Ilaha Illa Allah\nExtracted from &#8220;The Decreed Obligations that every Muslim man and woman must know&#8221;.\nTaken from the works of the Reviver of the Twelfth Century: Shaykh-ul-Islaam Muhammad bin ‘Abdil-Wahhaab and from his grandchildren and others (May Allah Most High have mercy upon them all)\nCollected by the one in need of his All-Powerful Lord`s pardon His Eminence ash-Shaykh ‘Abdullah bin Ibraaheem bin ‘Uthmaan al-Qar`aawee (May Allah forgive him, his parents, his teachers, and all of the Muslims)\nThe audio recitation is by Abu Ahmed Ash-Shaythamee and downloaded from www.ajurry.com\nThe translation is by Aboo ‘Imraan al-Mekseekee for www.dtssbc.com\n"
        },
        {
          "ar": "الأول : العلم بمعناها نفياً وإثباتاً\n",
          "en": "One: al-‘Ilm (knowledge) with the meaning of negation and affirmation.\n"
        },
        {
          "ar": "الثاني : اليقين ، وهو : كمال العلم بها ، المنافي للشك والريب .\n",
          "en": "Two: al-Yaqeen (certainty) which is the completeness of knowledge by it, it negates doubt and conjecture.\n"
        },
        {
          "ar": "الثالث : الإخلاص المنافي للكذب .\n",
          "en": "Three: al-Ikhlaas (sincerity) which negates Shirk (polytheism).\n"
        },
        {
          "ar": "الرابع : الصدق المنافي للكذب .\n",
          "en": "Four: as-Sidq (honesty) which negates falsehood, it prevents falling into hypocrisy.\n"
        },
        {
          "ar": "الخامس : المحبة لهذه الكلمة ، ولما دلت عليه ، والسرور بذلك .\n",
          "en": "Five: al-Mahabbah (love) of this word (Laa Ilaha Illa Allah) and what proves it and to be content with that.\n"
        },
        {
          "ar": "السادس : الانقياد لحقوقها ، وهي : الأعمال الواجبة ، إخلاصاً لله ، وطلباً لمرضاته .\n",
          "en": "Six: al-Inqiyaad (submission) to its rights and it is to do the obligatory deeds sincerely for Allah seeking His Pleasure.\n"
        },
        {
          "ar": "السابع : القبول المنافي للرد .\n",
          "en": "Seven: al-Qubool (acceptance) which negates rejection.\n"
        },
        {
          "ar": "أدلة هذه الشروط من كتاب الله تعالى ومن سنة رسول الله صلى الله عليه وسلم :\n",
          "en": "Evidences that these conditions are from the Book of Allah Most High and the Sunnah of the Messenger of Allah peace be upon him.\n"
        },
        {
          "ar": "دليل العلم : قوله تعالى : { فأعلم أنه لا إله إلا الله }\n",
          "en": "The evidence concerning al-‘Ilm (knowledge) is (the translation of the meaning of) His Statement:<br />\n“Know that there is nothing worthy or worship except for Allah.”\n"
        },
        {
          "ar": "وقوله : { إلا من شهد بالحق وهم يعلمون }\n",
          "en": "And (the translation of the meaning of) His Statement:<br />\n“&#8230;Except for the one who testifies to the truth and they know.”\n"
        },
        {
          "ar": "أي بـ &#8221; لا إله إلا الله &#8221; { وهم يعلمون } بقلوبهم مانطقوا به بألسنتهم .\n",
          "en": "This “truth” is referring to Laa Ilaha Illa Allah.  “&#8230;And they know” What is in their hearts which is pronounced by their tongues.\n"
        },
        {
          "ar": "ومن السنة : الحديث الثابت في الصحيح عن عثمان رضي الله عنه قال :<br />\n( قال رسول الله صلى الله عليه وسلم : من مات وهو يعلم أنه لا إله إلا الله دخل الجنة ) .\n",
          "en": "And from the Sunnah is the established narration in the Saheeh from ‘Uthmaan, Allah be pleased with him, who said that the Messenger of Allah (sallallahu alayhi wa sallam) said:\n“Whoever dies knowing that there is nothing worthy or worship except for Allah will enter paradise.”\n"
        },
        {
          "ar": "ودليل اليقين : قوله تعالى : { إنما المؤمنون الذين ءامنوا بالله ورسوله ثم لم يرتابوا وجاهدوا باموالهم وأنفسهم في سبيل الله أولئك هم الصادقون }\n",
          "en": "And the evidence concerning al-Yaqeen (certainty) is (the translation of the meaning of) His Statement: \n“The believers are those who believe in Allah and His Messenger then they do not doubt it and they strive with their wealth and with their souls in the path of Allah they are those who believe with certainty.”\n"
        },
        {
          "ar": "فاشترط في صدق إيمانهم بالله ورسوله كونهم لم يرتابوا -أي لم يشكوا &#8211; فأما المرتاب فهو من المنافقين .\n",
          "en": "So it is stipulated concerning the honesty of their faith in Allah and His Messenger that they did not falter meaning that they did not cast doubts. As for the one who doubts then he is from the Munaafiqoon (the Hypocrites).\n"
        },
        {
          "ar": "ومن السنة : الحديث الثابت في الصحيح عن أبي هريرة رضي الله عنه ، قال : ( قال رسول الله صلى الله عليه وسلم :<br />\nأشهد أن لا إله إلا الله وأني رسول الله ، لا يلقى الله بهما عبد غير شاك فيهما إلا دخل الجنة )\n",
          "en": "And from the Sunnah is the established narration in the Saheeh from Aboo Hurayrah (radiAllahu anhum) that he mentioned the Messenger of Allah (sallallahu alayhi wa sallam) saying:“I bear witness that nothing has the right to be worshipped except for Allah and that I am the Messenger of Allah not holding Allah by them both to be without doubt in the two testimonies except that he will enter paradise”.\n"
        },
        {
          "ar": "وفي رواية : ( لا يلقى الله بهما عبد غير شاك فيحجب عن الجنة ) .\n",
          "en": "And in another narrative:<br />\n“Not holding by Allah by them both without doubt that he will be covered in the paradise.”\n"
        },
        {
          "ar": "وعن أبي هريرة أيضاً من حديث طويل : ( من لقيت من وراء هذا الحائط يشهد أن لا إله إلا الله مستيقناً بها من قلبه فبشره بالجنة )\n",
          "en": "And also the long narration of Aboo Hurayrah:<br />\n“Whoever I meet behind this wall testifying that there is nothing worthy or worship except for Allah with full conviction of it in his heart then give him the glad tidings of paradise.”\n"
        },
        {
          "ar": "ودليل الإخلاص : قوله تعالى : { ألا لله الدين الخالص }\n",
          "en": "And the evidence concerning al-Ikhlaas (sincerity) is (the translation of the meaning of) His Statement: “Is not the pure religion to Allah?”\n"
        },
        {
          "ar": "وقوله سبحانه :<br />\n{ وما من أمروا إلا ليعبدوا الله مخلصين له الدين حنفاء } .\n",
          "en": "And (the translation of the meaning of) His Statement:<br />\n“They were only ordered to worship Allah sincerely for Him and worship none but Him Alone.”\n"
        },
        {
          "ar": "ومن السنة : الحديث الثابت في الصحيح عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم : ( أسعد الناس بشفاعتي من قال لاإله إلا الله خالصاً من قلبه -أو من نفسه &#8211; )\n",
          "en": "And from the Sunnah is the established narration in the Saheeh from Aboo Hurayrah (radiAllahu anhum) from the Prophet (sallallahu alayhi wa sallam):<br />\n“The happiest people to receive my intercession are those who said Laa Ilaha Illa Allah (there is nothing worthy of worship except for Allah) sincerely from one`s heart  or soul.”\n"
        },
        {
          "ar": "وفي الصحيح عن عتبان بن مالك رضي الله عنه عن النبي صلى الله عليه وسلم :<br />\n( إن الله حرم على النار من قال لا إله إلا الله يبتغي بذلك وجه الله عز وجل )\n",
          "en": "And from an-Nisaa`ee in (his book) al-Yawm wal-Laylah from the narration of two of the companions from the Prophet (sallallahu alayhi wa sallam):<br />\n“Whoever says Laa Ilaha Illa Allah Wahdahu Laa Shareeka Lah lahul-Mulk wa lahul-Hamd wa Huwa ‘alaa kulli shayin Qadeer (There is nothing worthy of worship except for Allah Alone, He does not have any partner, to Him belongs the dominion and to Him is all praise. He is Able to do all things) sincerely in one`s heart affirming what was uttered by the tongue then Allah will tear a hole in the heavens to look at the one who said it from amongst the inhabitants ofearth and the right given to the servant is that Allah will look to him and gives him what he asks for.”\n"
        },
        {
          "ar": "وللنسائي في &#8221; اليوم والليلة &#8220;من حديث رجلين من الصحابة عن النبي صلى الله عليه وسلم : ( من قال لا إله إلا الله وحده لا شريك له ، له الملك ، وله الحمد ، وهو على كل شيء قدير ، مخلصاً بها من قلبه ، يصدق بها لسانه . . . إلا فتق الله السماء فتقاً ، حتى ينظر إلى قائلها من أهل الأرض ، وحق لعبد نظر إليه الله أن يعطيه سؤله ) .\n",
          "en": "And from an-Nisaa`ee in (his book) al-Yawm wal-Laylah from the narration of two of the companions from the Prophet (sallallahu alayhi wa sallam):<br />\n“Whoever says Laa Ilaha Illa Allah Wahdahu Laa Shareeka Lah lahul-Mulk wa lahul-Hamd wa Huwa ‘alaa kulli shayin Qadeer (There is nothing worthy of worship except for Allah Alone, He does not have any partner, to Him belongs the dominion and to Him is all praise. He is Able to do all things) sincerely in one`s heart affirming what was uttered by the tongue then Allah will tear a hole in the heavens to look at the one who said it from amongst the inhabitants of earth and the right given to the servant is that Allah will look to him and gives him what he asks for.”\n"
        },
        {
          "ar": "ودليل الصدق : قوله تعالى :<br />\n{ الم * أحسب الناس أن يتركوا أن يقولوا ءامنا وهم لا يفتنون * ولقد فتنا الذين من قبلهم فليعلمن الله الذين صدقوا وليعلمن الكاذببين }\n",
          "en": "And the evidence concerning as-Sidq (honesty) is (the translation of the meaning of) His Statement:<br />\n“Alif Laam Meem. Do the people think that they will be left alone to say that they believe and that they will not be tested? Indeed We tested those before them Allah surely knows those who believe and He knows those who pretend.”\n"
        },
        {
          "ar": "وقوله تعالى :<br />\n{ ومن الناس من يقول ءامنا بالله واليوم الآخر وما هم بمؤمنين * يخادعون الله والذين ءامنوا وما يخدعون إلا أنفسهم وما يشعرون * في قلوبهم مرض فزادهم الله مرضاً ولهم عذاب أليم بما كانوا يكذبون } .\n",
          "en": "And (the translation of the meaning of) His Statement:<br />\n“And from amongst mankind are those who say we believe in Allah and in the Last Day but they are not really believers. They seek to deceive Allah and those who believe but they only are deceiving themselves while not even realizing it. In their hearts is a disease and Allah increases their disease and they will have a painful punishment for what they pretended about.”\n"
        },
        {
          "ar": "ومن السنة : ما ثبت في الصحيحين عن معاذ بن جبل رضي الله عنه عن النبي صلى الله عليه وسلم :<br />\n( ما من أحد يشهد أن لا إله إلا الله وأن محمداً رسول الله ، صادقاً من قلبه ، إلا حرمه الله على النار ) .\n",
          "en": "And from the Sunnah is what has been established from the two Saheehs from Mu`adh bin Jabal, may Allah be pleased with him, that the Prophet (sallallahu alayhi wa sallam) said:<br />\n“There is not one person who testifies that there is nothing worthy of worship except for Allah and that Muhammad is His Servant and Messenger honestly within his heart except that Allah will forbid him from the hellfire.”\n"
        },
        {
          "ar": "ودليل المحبة : قوله تعالى :<br />\n{ ومن الناس من يتخذ من دون الله أنداداً يحبونهم كحب الله والذين ءامنوا أشد حباً لله }\n",
          "en": "And the evidence concerning al-Mahabbah (love) is (the translation of the meaning of) His Statement:<br />\n“And amongst mankind are those who take other than Allah as partners loving them as they love Allah but those who believe are strict in their love to Allah (Alone).”\n"
        },
        {
          "ar": "وقوله :<br />\n{ يأيها الذين ءامنوا من يرتد منكم عن دينه فسوف يأتي الله بقوم يحبهم ويحبونه أذلة على المؤمنين أعزة على الكافرين يجاهدون في سبيل الله ولا يخافون لومة لائم } .\n",
          "en": "And (the translation of the meaning of) His Statement:<br />\n“O` You who believe whoever apostates from amongst you from his religion then Allah will bring a people whom He will love and they will love Him, being kind with the believers and harsh upon the disbelievers, fighting in the path of Allah and not fearing the blame of those who find fault (with others).”\n"
        },
        {
          "ar": "ومن السنة : ما ثبت في الصحيح عن أنس رضي الله عنه ، قال :<br />\n( قال رسول الله صلى الله عليه وسلم : ثلاث من كن فيه وجد حلاوة الإيمان : أن يكون الله ورسوله أحب إليه مما سواهما ، وأن يحب المرء لا يحبه إلا لله ، وأن يكره ان يعود في الكفر بعد إذ أنقذه الله منه كما يكره أن يقذف في النار ) .\n",
          "en": "And from the Sunnah is what is established in the Saheeh from Anas, may Allah be pleased with him who said that the Messenger of Allah (sallallahu alayhi wa sallam) said:<br />\n“There are three ofwhom the sweetness of faith can be found within them they are the one whom Allah and His Messenger are more beloved to him than anything else, the one who loves a person for the sake of Allah, and the one who hates to return to disbelief after Allah had saved him from it just as he would hate to be thrown in the hellfire.”\n"
        },
        {
          "ar": "ودليل الانقياد : ما دل عليه قوله تعالى :<br />\n{ وأنيبوا إلى ربكم وأسلموا من قبل أن ياتيكم العذاب ثم لا تنصرون }\n",
          "en": "And the evidence concerning al-Inqiyaad (submission) is based on His Statement:<br />\n“Repent to your Lord and submit to Him”\n"
        },
        {
          "ar": "وقوله : { ومن أحسن ديناً ممن أسلم وجهه لله وهو محسن }\n",
          "en": "And (the translation of the meaning of) His Statement:<br />\n“And whoever perfects his religion from whomsoever has submitted himself to Allah while doing good deeds.”\n"
        },
        {
          "ar": "وقوله : { ومن يسلم وجهه لله وهو محسن فقد استمسك بالعروة الوثقى }\n",
          "en": "And (the translation of the meaning of) His Statement:<br />\n“And whosoever submits himself to Allah and does good deeds has held onto al-‘Urwah al-Wuthqaa”\n"
        },
        {
          "ar": "أي بـ &#8221; لا إله إلا الله&#8221;\n",
          "en": "Here al-‘Urwah al-Wuthqaa means Laa Ilaha Illa Allah.\n"
        },
        {
          "ar": " وقوله تعالى :<br />\n{ فلا وربك لا يؤمنون حتى يحكموك فيما شجر بينهم ثم لا يجدوا في انفسهم حرجاً مما قضيت ويسلموا تسليماً } .\n",
          "en": "And (the translation of the meaning of) His Statement:<br />\n“No by your Lord they will not believe until you passed judgment for them in their disputes then they will not find in themselves harm in what you have decreed and they submit whole heartedly.”\n"
        },
        {
          "ar": "ومن السنة : قوله صلى الله عليه وسلم : ( لا يؤمن أحدكم حتى يكون هواه تبعاً لما جئت به )\n",
          "en": "And from the Sunnah is his statement (sallallahu alayhi wa sallam) :<br />\n“None of you truly believe until one`s desires follow what I have brought.”\n"
        },
        {
          "ar": "وهذا هو تمام الانقياد وغايته .\n",
          "en": "And this in fact is complete submission and its main focus.\n"
        },
        {
          "ar": "ودليل القبول : قوله تعالى :<br />\n{ وكذلك ما أرسلنا من قبلك في قرية من نذير إلا قال مترفوها إنا وجدنا ءاباءنا على أمة وإنا على ءاثارهم مقتدون * قال أولوا جئتكم بأهدى مما وجدتم عليه ءاباءكم قالوا إنا بما أرسلتم به كافرون * فانتقمنا منهم فانظر كيف كان عاقبة المكذبين }\n",
          "en": "And the evidence concerning al-Qubool (acceptance) is (the translation of the meaning of) His Statement:<br />\n“And likewise We did not send before you in any village one who would warn except that its affluent would say, “Indeed we found our fathers upon a certain way and we will continue to be upon their way.” The one warning said, “Even if I bring to you all that which contains more guidance than what you found your father upon?” They said, “Indeed we do not believe in what you have been sent.” Therefore We took revenge of them so look at the consequence of those who denied.”\n"
        },
        {
          "ar": "  وقوله تعالى :<br />\n{ إنهم كانوا إذا قيل لهم لا إله إلا الله يستكبرون * ويقولون أإنا لتاركوا ءالهتنا لشاعر مجنون } .\n",
          "en": "And (the translation of the meaning of) His Statement:<br />\n“Indeed they used to behave arrogantly when it was said to them Laa Ilaha Illa Allah. They would say, “Should we leave off our gods to follow a crazy poet?”\n"
        },
        {
          "ar": "ومن السنة :<br />\nما ثبت في الصحيح عن ابي موسى رضي الله عنه عن النبي صلى الله عليه وسلم :<br />\n( مثل ما بعثني الله به من الهدى والعلم كمثل الغيث الكثير أصاب أرضاً ، فكان منها نقية قبلت الماء فأنبتت الكلأ والعشب الكثير ، وكانت منها أجادب أمسكت الماء فنفع الله به الناس فشربوا وسقوا وزرعوا ، واصاب منها طائفة أخرى إنما هي قيعان لا تمسك الماء ولا تنبت كلأ ، فذلك مثل من فقه في دين الله ونفعه ما بعثني الله به فعلم وعلّم ، ومثل من لم يرفع بذلك راساً ولم يقبل هدى الله الذي أرسلت به ) .\n",
          "en": "And from the Sunnah from what has been established in the Saheeh from Aboo Musaa, may Allah be pleased with him, from the Prophet (sallallahu alayhi wa sallam) who said:<br />\n“The example of guidance and knowledge with which Allah has sent me is like abundant rain falling on the earth, some of which was fertile soil that absorbed rain water and brought forth vegetation and grass in abundance. Another portion of it was hard and held the rain water and Allah benefited the people with it and they utilised it for drinking, making their animals drink from it and for irrigation of the land for cultivation. And a portion of it was barren which could neither hold the water nor bring forth vegetation. The first is the example of the person who comprehends Allah`s religion and gets benefit which Allah has revealed through me and learns and then teaches others. The last example is that of a person who does not care for it and does not take Allah`s guidance revealed through me.”\n"
        }
      ]
    }
  }
]
